

import './assets/css/waves.css';

import './assets/css/magnific-popup.css';
import './assets/css/style.css';
import './assets/css/colors/red.css';

import SimpleSlider from './components/corusel';
import { Route, Switch, BrowserRouter as Router, withRouter,Redirect  } from 'react-router-dom';

import React, {Component } from 'react';
// import './components/Header.css';
// import { CSSTransition } from 'react-transition-group';
import burger from '../src/assets/burger.png'

// import Header from './components/Header';
// import SimpleSlider from './components/corusel'
import {Navbar, Nav, NavItem,NavDropdown,Form,FormControl,Button,Row,Col,Card} from 'react-bootstrap';
import logo from './assets/logo.png';
import img1 from './1.png';
import img2 from './2.png';
import img3 from './3.png';
import img4 from './4.png';
import img5 from './5.png';
import img6 from './6.png';
import img7 from './7.png';
import img8 from './8.png';
import img9 from './9.png';
import img10 from './10.png';
import cert from './certsn.jpg';
import { YMaps, Map, Placemark } from "react-yandex-maps";
const mapData = {
  center: [43.200693, 76.858211],
  zoom: 13,
};

const coordinates = [
  [43.200693, 76.858211]
];



class App extends Component {
  constructor(props) {
    super(props);
    
    this.state = {
      isShow: true,
    };
    this.state = {
      list: [{

        						
        menu1:'Главная',
        menu2:'О компании',
        menu3:'Управление',
        menu4:'Проекты',
        menu5:'Деятельность',
        menu6:'Сертификаты и Лицензии',
        menu7:'Контакты',

        menu8:'Выбор языка',

        text01:"В мире есть самые современные технологии…",
        text02:"эффективные разработки...",
        text03:"и есть надежные партнеры",
        text1: "Многие из Вас сегодня впервые узнают о нашей компании, а те, кто сотрудничает с нами, возможно, еще раз убедятся в правильности сделанного выбора",
        text2: "За время своего существования, мы добились определенных успехов и достижений, расширили рынок предложения своих услуг. Границы нашего сотрудничества сейчас охватывают круг как отечественных, так и зарубежных партнеров.",  
        text3: "Инициатива, увлеченность, квалифицированный персонал, преданность компании и забота об интересах заказчика – вот ключ к достижению поставленных целей.",
        text4: "Приглашаем Вас ознакомиться с нашим опытом и производственными ресурсами и выражаем уверенность, что «Инженерная фирма MG Engineering» может быть полезна в успешной реализации запланированных Вами задач.",
        text5: "Мы открыты для сотрудничества со всеми заинтересованными компаниями и будем оказывать всемерную поддержку в построении и укреплении взаимовыгодных партнерских отношений.",
        text6: "С наилучшими пожеланиями успехов в бизнесе,",
        text7: "Коллектив «Инженерной фирмы MG Engineering»",

        
        about1:"ТОО «Инженерная фирма MG Engineering» основана в августе 2002 г. по инициативе группы специалистов, долгое время проработавших в нефтегазовой и строительной отраслях. До декабря 2013 г. компания известна под названием «Мунай Графика», но после завершенной реструктуризации переименована и продолжает работу под новым названием, отражающим основное направление профессиональной деятельности.",
        about111:"«Инженерная фирма MG Engineering» специализируется в области инженерно-технической разработки и проектирования, материально-технического обеспечения и комплектации, управления строительным производством нефтегазовых сооружений и предприятий.",
        about2:"Основная цель – качественное выполнение (в максимально сжатые и гарантированные сроки) комплекса инженерных услуг, обеспечивающее и удовлетворяющее все требования заказчика.",
        about3:"Для достижения поставленных целей ТОО «Инженерная фирма MG Engineering» обладает сформировавшимся потенциалом. В своей работе мы используем все доступные возможности и инструменты, включая:",
        about4:"применение новых технологий;",
        about5:"действующая, сертифицированная система управления качеством;",
        about6:"постоянное повышение профессионального уровня и квалификации сотрудников;",
        about7:"инновационные подходы и современные технические решения;",
        about8:"эффективное управление проектированием;",
        about9:"использование практического опыта предшествующих реализованных проектов.",
        about10:"Работая в условиях рынка и осознавая необходимость повышения конкурентоспособности, мы уделяем большое внимание постоянному улучшению качества предоставляемых услуг. Для максимального сокращения сроков при соблюдении стандартов качества ТОО «Инженерная фирма MG Engineering» использует в полном масштабе современные технологии в проектировании.",
        about11:"Реализовав множество серьезных проектов, мы значительно расширили рынок предложения своих услуг, заняв в нем определенную нишу. Границы нашего сотрудничества сейчас охватывают круг как отечественных, так и зарубежных партнеров.",
        about12:"Критерии успешной деятельности:",
        about13:"заинтересованность заказчика в наших услугах;",
        about14:"четкое формулирование перечня предоставляемых услуг;",
        about15:"полный объем выполняемых работ от анализа и проектирования до сдачи объекта «под ключ»;",
        about16:"тщательное планирование и контроль выполнения подрядных работ и услуг;",
        about17:"разбивка проекта по этапам;",
        about18:"тесное взаимодействие в ходе работ с партнером-заказчиком;",
        about19:"реальность и оправданность ожиданий заказчика;",
        about20:"четкое понимание поставленных задач и целей каждым членом коллектива;",
        about21:"трудолюбивый, квалифицированный, ориентированный на наилучшее выполнение работы персонал.",
               
        upr1:'Наблюдательный совет',
        upr2:'Миндеев Андрей Ноэльевич',
        upr3:'Председатель Наблюдательного Совета ТОО «MG Engineering»',
        upr4:'Образование:',
        upr5:'Ленинградский Государственный университет;',
        upr6:'Алма-Атинская архитектурно- строительный институт.',
        upr7:'Профессиональный опыт:',
        upr8:'Руководил рядом строительно- монтажных и проектных организаций.',
        upr9:'Один из основателей компании «MG Engineering»',
        upr10:'Сабыркулова Юлия Каировна',
        upr11:'Председатель Наблюдательного Совета, управляющий партнер ТОО «MG Engineering»',
        upr12:'Образование:',
        upr13:'Казахская Государственная архитектурно- строительная академия;',
        upr14:'Санкт- Петербургский Государственный университет.',
        upr15:'Профессиональный опыт:',
        upr16:'Управление, планирование и экономика транспортных предприятий.',
        upr17:'Предпринимательская деятельность.',
        upr18:'В августе 2002 года основала инженерную фирму «Мунай Графика».',
        upr19:'Тример Карстен Франк',
        upr20:'Председатель Наблюдательного Совета, управляющий партнер ТОО «MG Engineering»',
        upr21:'Образование:',
        upr22:'Московский институт нефти и газа им. И.М.Губкина.',
        upr23:'Профессиональный опыт:',
        upr24:'Участвовал в крупнейших международных проектах строительства нефти- газо- проводных объектов и сооружений.',
        upr25:'Руководитель крупными подразделениями Казахстана, Росси, Восточной Европы.',
        upr26:'Руководство',
        upr27:'Жук Иван Витальевич',
        upr28:'Генеральный деректор',
        upr29:'Образование:',
        upr30:'Казахстанская Академия Транспорта и Коммуникаций имени М.Тынышбаева',
        upr31:'Профессиональный опыт:',
        upr32:'Руководил организациями производственно- технической комплектации, поставки и сервисного обслуживания оборудования и технологических систем объектов нефтегазовой отрасли. SGC Stroygazcosulting, АОА «Алматыпрострой», BSI Indusries Inc.',
        upr33:'Михайловский Игорь Юрьевич',
        upr34:'',
        upr35:'Советник Генерального директора',
        upr36:'',
        upr37:'Образование:',
        upr38:'Томский политехнический институт;',
        upr39:'Учебно- Исследовательский центр повышения квалификации Московского Государственного университета нефти и газа им. И.М. Губкина.',
        upr40:'Профессиональный опыт:',
        upr41:'Занимался планово- экономической, договорной работой на предприятиях энергетической отрасли. Руководил проектными организациями.',
        upr42:'Один из основателей компании «MG Engineering»',
        upr43:'Миндеев Александр Андреевич',
        upr44:'Коммерческий директор',
        upr45:'',
        upr46:'Образование:',
        upr47:'Казахский национальный технический университет им. К.И. Сатпаева.',
        upr48:'Учебно- Исследовательский центр повышения квалификации Московского Государственного университета нефти и газа им. И.М. Губкина.',
        upr49:'Профессиональный опыт:',
        upr50:'Корпорация «BEK» - организация и управление строительством объектов жилищно- гражданского назначения. ТОО «КИТНГ», ТОО «Мунай Графика». Участвовал в разработке проектов и строительстве магистральных нефтегазопроводов Казахстан- Китай. Руководитель проектных работ предприятий и сооружений нефтегазового комплекса.',
        upr51:'Лысяк Владимир Петрович',
        upr52:'Технический директор',
        upr53:'Образование:',
        upr54:'Казахский национальный технический университет им. К.И. Сатпаева. Машины и оборудование нефтяной и газовой промышленности.',
        upr55:'Профессиональный опыт:',
        upr56:'Управление организацией строительства АО «Имсталькон». Проектирование обьектов нефтегазового комплекса АО «ГеоКОД», ТОО « Мунай Графика», ТОО «КИТНГ», Эксплуатация обьектов и сооружений нефтегазовых месторождений ТОО « СП Казгермунай», АО « Тургай Петролеум».',
        upr57:'Региональные представители',
        upr58:'Гуменюк Виктор Федорович',
        upr59:'Представитель г. Нурсултан',
        upr60:'Образование:',
        upr61:'Целиноградский инженерно- строительный институт',
        upr62:'Профессиональный опыт:',
        upr63:'Участвовал в строительстве линейных сооружений магистральных нефтепродуктопроводов. Руководил строительными управлениями системы «Госкомнефтепродукта». Руководитель и владелец частной строительно- монтажной фирмы.',
        upr64:'Гегамян Армен Эвагович',
        upr65:'Представитель г.Уральск, г.Атырау, г.Самара',
        upr66:'Образование:',
        upr67:'Владикавказское высшее Военное командное училище ВВ МВМ ССР;Алма-Атинская Военная академия Министерства обороны РК.',
        upr68:'Профессиональный опыт:',
        upr69:'Занимал разные должности в командно- руководящем составе во время службы в армии. После демобилизации – частный предприниматель. Владелец сервисной- строительный компании.',
        upr70:'Курбангалиев Бактыгали',
        upr71:'Представитель г.Актобе',
        upr72:'Образование:',
        upr73:'Нукусский автодорожный техникум;',
        upr74:'Карагандинский Государственный университет им. Букетова',
        upr75:'Профессиональный опыт:',
        upr76:'Работал на предприятиях Агропромышленного комплекса, руководил рядом частных структур. Представитель ТОО «MG Engineering»',
                





        proj1:'Наша компания на постоянной основе сотрудничает с проектными институтами России, Украины, Латвии, Канады и Германии.',
        proj2:'В период с 2002 г. компания участвовала в реализации более 150 проектов строительства нефтегазовых предприятий, объектов и сооружений различной сложности.',
        proj3:'Каждый реализуемый проект соответствует стратегическому плану нашей компании и базируется на максимальном удовлетворении потребностей Заказчика. При этом исследуются, анализируются и учитываются его индивидуальные пожелания и замечания с корректировкой в последующем процессе работ.',
        proj4:'ОСНОВНЫЕ ПРОЕКТЫ:',
        proj5:'Заказчик ТОО «КазГерм-Сервис»',
        proj6:'Строительство АГНКС по адресу: город Шымкент, ул. Кайкельды батыра, здание 19/1',
        proj7:'Заказчик ТОО «Сагиз Петролиум»',
        proj8:'Строительство приемо-сдаточного пункта Копа с магистральным нефтепроводом от ЦППН до ПСП «Копа» и вахтовым поселком на 20 человек в Байганинском районе, Актюбинской обл.',
        proj9:'Заказчик ТОО "ProsperaResources"',
        proj10:'Корректировка проектно-сметной документации "Нефтеналивной терминал Сагиз" (ННТ)',
        proj11:'Заказчик ТОО "ПетроКазахстанойл Продактс"',
        proj12:'Проведение авторского надзора в период строительно-монтажных работ по проекту: "Строительство установки точечного налива нефтепродуктов с рекуперацией паров на Шымкенском НПЗ.',
        proj13:'Заказчик Китайская нефтяная корпорация по Технике и Развитию',
        proj14:'Технико-экономическое обоснование( ТЭО) объекта "Строительство завода по производству ЭТБЭ/МТБЭ и порошкового полипропилена."',
        proj15:'Заказчик ТОО «Кнауф Гипс Капчагай»',
        proj16:'Газоснабжение завода по производству гипсокартонных плит и сухих строительных смесей ТОО "Кнауф Гипс Капчагай"',
        proj17:'Заказчик ТОО "KAZPETROLEUM TECHNOLOGIES" (Казпетролеумтехнолоджис)',
        proj18:'Проектно-изыскательские работы "Оснащение производственных объектов ТОО "Атырауский нефтеперерабатывающий завод" контрольными приборами."',
        proj19:'Заказчик ТОО «CaspiOilGas»',
        proj20:'Oбустройство нефтяного месторождения «Ракушечное» в период разведки пробной эксплуатации. Пункт подготовки нефти на нефтяном месторождении «Ракушечное».',
        proj21:'Заказчик «Alties Petroleum International B.V.»',
        proj22:'Oбустройство нефтяного месторождения «Бесболек» на период разведки и добычи;',
        proj23:'Строительство нефтепровода с месторождения «Акжар» до места врезки в магистральный нефтепровод АО «КазТрансОйл»',
        proj24:'Пункт приема и транспортировки нефти «Карсак»;',
        proj25:'Технологический регламент эксплуатации приемо-сдаточного пункта «Карсак»;',
        proj26:'Проектирование воздушной линии электропередачи напряжением 35 киловольт от существующей подстанции Жаркамыс до проектируемой подстанции «Акжар»',
        proj27:'Заказчик ТОО «Бузачи Нефть»',
        proj28:'Разработка и реализация программы утилизации попутно добываемого газа на газонефтяных месторождениях «Каратурун Морской» и «Каратурун Восточный».',
        proj29:'Заказчик АО «Казхиммонтаж холдинг» (Agip KCO)',
        proj30:'Обустройство Восточно-Кашаганского нефтегазового месторождения. Резервуары вертикальные стальные объемом 1500 м³; 1800 м³; 2200 м³ и 5800 м³. для хранения воды на площадке инженерного обеспечения городка строителей.',
        proj31:'Заказчик ТОО «Казахский институт транспорта нефти и газа»',
        proj32:'По просьбе и поручению акционеров ТОО «КИТНГ», в период с дек. 2007 г. по июнь 2011 г., группой руководящих работников и главных специалистов компании «MG Engineering» реализованы значимые этапы работ по управлению проектом «Проектирование эффективной организации» к выполнению комплекса проектных работ:',
        proj33:'«Строительство магистрального газопровода Казахстан – Китай»;',
        proj34:'«Строительство магистрального нефтепровода Кенкияк – Кумколь»',
        proj35:'Заказчик «Big Sky Energy Corp.»',
        proj36:'Обустройство нефтяного месторождения «Морское».',
        proj37:'Заказчик Lancaster Petroleum (АО «ККМ Operating Company»)',
        proj38:'Сбор и транспортировка продукции со скважин нефтяного месторождения «Кокжиде-Надсолевое»;',
        proj39:'Расширение цеха подготовки нефти на нефтяном месторождении «Кокжиде-Надсолевое»;',
        proj40:'Новый вахтовый поселок проживания обслуживающего персонала;',
        proj41:'Разработка нормативно технической документации «Технологические потери нефти и газа при сборе, транспортировке и подготовке на промышленных объектах АО «ККМ Operating Company»',
        proj42:'Заказчик АО «CNPC-Актобемунайгаз»',
        proj43:'Объекты и сооружения системы автоматического герметичного налива и слива нефти на железнодорожной станции «Бестамак».',
        proj44:'Заказчик АО «Имсталькон»',
        proj45:'Строительство технологических резервуаров вертикальных стальных центрального пункта подготовки нефти на газонефтяном месторождении «Каражанбас»;',
        proj46:'Реконструкция резервуарного парка насосной промежуточной станции «Тенгиз»;',
        proj47:'Резервуарный парк очищенной кислой воды и общего техобслуживания на нефтяном месторождении «Тенгиз».',
        proj48:'Заказчик АО «Каражанбасмунай»',
        proj49:'Установка групповых замерных установок;',
        proj50:'Строительство новых технологических объектов на газонефтяном месторождении «Каражанбас»;',
        proj51:'Расширение резервуарного парка дожимной насосной станции на газонефтяном месторождении «Каражанбас»;',
        proj52:'Расширение центрального пункта подготовки нефти.',
        proj53:'Заказчик АО «Каспий Нефть ТМЕ»',
        proj54:'Сбор и транспортировка продукции скважин нефтегазоконденсатное месторождения «Алибек Южный»;',
        proj55:'Расширение пункта налива нефти на месторождении «Алибек Южный»;',
        proj56:'Установка закачки воды на месторождении «Алибек Южный»;',
        proj57:'Внутрипромысловые дороги на месторождении «Алибек Южный»;',
        proj58:'Реконструкция подстанции ПС-110/35/10 кВ «Кенкияк» и другие сооружения и устройства энергообеспечения.',
        proj59:'Заказчик АО «Конденсат»',
        proj60:'Ремонт и замена участка газопровода неочищенного газа ГП-3-Оренбург;',
        proj61:'Разработка концептуального проекта фирменной автозаправочной станции, г. Уральск.',
        proj62:'Заказчик АО «МонтажСпецСтрой»',
        proj63:'Разработка тендерной документации «Расширение установки забора морской воды»;',
        proj64:'Блочно-модульное здание временного Офиса ТОО «Тенгизшевройл»;',
        proj65:'Газотурбинная электростанция на газонефтяном месторождении «Дунга».',
        proj66:'Заказчик ТОО «BN Мунай»',
        proj67:'Обустройство газового месторождения «Кзылой» в Актюбинской области;',
        proj68:'Внутрипромысловые газосборные трубопроводы.',
        proj69:'Заказчик ТОО «Dostyk Refinery»',
        proj70:'Железнодорожная экспортно-перевалочная нефтебаза светлых нефтепродуктов «Достык-2»;',
        proj71:'Реконструкция экспортно-железнодорожной перевалочной нефтебазы «Достык».',
        proj72:'Заказчик ТОО «Prosystems Petroleum»',
        proj73:'Реконструкция сервисной автозаправочной станции, г. Алматы.',
        proj74:'Заказчик ТОО «Sinooil»',
        proj75:'Реконструкция базы нефтепродуктов г. Нур-Султан;',
        proj76:'Сервисная автозаправочная станция, Алматинская область, Карасайский район, трасса Каскелен-Шамалган;',
        proj77:'Сервисная автозаправочная станция, Алматинской области, Енбекшиказахский район;',
        proj78:'Сервисная автозаправочная станция, Алматинская область, Жамбыльский район, село Узунагаш.',
        proj79:'Заказчик ТОО «Артис Оверсис С.А.Казахстан»',
        proj80:'Расширение нефтяного терминала. Морской порт г. Актау.',
        proj81:'Заказчик ТОО «Жаикмунай»',
        proj82:'Объекты и сооружения обустройства Чинаревского нефтегазоконденсатного месторождения.',
        proj83:'Заказчик ТОО «Казахойл Актобе»',
        proj84:'Обустройство нефтегазоконденсатного месторождения «Кожасай» на период пробной эксплуатации;',
        proj85:'Пункт приема и подготовки нефти на нефтегазоконденсатном месторождении «Алибекмола»;',
        proj86:'Система утилизации промышленных стоков путем их закачки в пласт на месторождении «Алибекмола»;',
        proj87:'Система поддержания пластового давления в северной части нефтегазоконденсатного месторождения «Алибекмола»;',
        proj88:'Разработка технологического регламента по эксплуатации пункта подготовки нефти на месторождении «Алибекмола»;',
        proj89:'Система энергоснабжения на месторождении «Кожасай»;',
        proj90:'Воздушные линии электропередач напряжением шесть киловольт с подстанцией «Южный Алибекмола» для электроснабжения Центрального пункта подготовки нефти и газа месторождения «Алибекмола».',
        proj91:'Заказчик ТОО «Кен-Сары»',
        proj92:'Обустройство нефтяного месторождения «Арыстановское», в период разведки и пробной эксплуатации. I-й, II-й пусковой комплекс;',
        proj93:'Обустройство месторождения «Арыстановское». III-й пусковой комплекс;',
        proj94:'Пункт подготовки нефти месторождения «Арыстановское».',
        proj95:'Заказчик ТОО «Казахстанско-Китайский Трубопровод»',
        proj96:'Строительство нефтепровода Казахстан-Китай. Участок Кенкияк-Кумколь. «Объединенный аварийно-восстановительный пункт».',
        proj97:'Заказчик ТОО «МегаТрансАзия»',
        proj98:'Расширение производственных мощностей нефтебазы. Цех переработки нефтепродуктов на ст. Бесколь Алакольского р-на Алматинской области;',
        proj99:'Завод по переработке нефти мощностью 1 100 000 т/год;',
        proj100:'Завод по переработке нефти мощностью 600 000 т/год.',
        proj101:'Заказчик ТОО «НТ Нурлы Мунай»',
        proj102:'Приёмо-сдаточный пункт нефти «НТ Нурлы Мунай».',
        proj103:'Заказчик ТОО «Сагиз Петролеум Компани»',
        proj104:'Оценка объемов и стоимости строительно-монтажных работ строительства приемо-сдаточного пункта «Ebity». Блокировочный трубопровод с врезкой в магистральный нефтепровод «Кенкияк-Атырау» в Байганинском районе Актюбинской обл.',
        proj105:'Заказчик ТОО «Саутс Ойл»',
        proj106:'Строительство коммерческого узла учета нефти и нефтепровода на нефтяном месторождении «Кенлык» с подключением к магистральному нефтепроводу Кенкияк-Кумколь.',
        proj107:'Заказчик ТОО «ТЭК Казахстан»',
        proj108:'Реконструкция топливных складов экипировки локомотивов на железнодорожных станциях Достык, Уштобе, Костанай.',
        proj109:'Заказчик ТОО «Умай-Маркет»',
        proj110:'Распределительный железнодорожный терминал светлых нефтепродуктов г. Арысь;',
        proj111:'Техническое сопровождение и управление строительством.',
        proj112:'Заказчик ТОО «Эрнст энд Янг консультационные услуги»',
        proj113:'Разработка технико-экономического обоснования на строительство и эксплуатацию 95 автомобильных газонаполнительных компрессорных станций в Республике Казахстан.',
        proj114:'и многие другие проекты, работы и услуги',


act01:'Деятельность компании направлена на качественное выполнение комплекса инженерных и проектных работ строительства новых, реконструкции и модернизации уже действующих объектов, сооружений и предприятий нефтегазовой отрасли.',

act02:'Компания открыта для сотрудничества, готова принять любые взаимовыгодные предложения в области эффективной реализации проектов добычи, подготовки, транспорта нефти и газа как в Казахстане, так и за его пределами.',

act1:'КОМПЛЕКСНОЕ ПРОЕКТИРОВАНИЕ:',
act2:'обустройства нефти-газо-конденсатных месторождений:',
act3:'- обустройство скважин;',
act4:'- систем промыслового сбора скважинной продукции;',
act5:'- замерных установок;',
act6:'- установок первичного сброса пластовой воды;',
act7:'- систем поддержания пластового давления;',
act8:'- кустовых насосных и компрессорных станций;',
act9:'объектов подготовки нефти и газа до товарной кондиции:',
act10:'- установок подготовки нефти и газа;',
act11:'- установок приема и учета поступаемой продукции;',
act12:'- установок сепарации, в том числе дегазации,',
act13:'- обезвоживания, обессоливания и демеркаптанизации нефти;',
act14:'- установок очистки и осушки газа;',
act15:'- установок предварительной подготовки газа (УППГ);',
act16:'- установок комплексной подготовки газа (УКПГ);',
act17:'- установок приготовления растворов и компонентов, сопутствующих очистки нефти и газа;',
act18:'- установок очистки пластовой воды;',
act19:'- технологических насосных и компрессорных станций;',
act20:'- резервуарных парков сбора готовой продукции;',
act21:'- насосных и компрессорных станций перекачки готовой продукции;',
act22:'',
act23:'объектов и сооружений транспорта нефти и газа:',
act24:'- магистральных трубопроводов любого назначения;',
act25:'- промысловых, технологических, распределительных трубопроводов нефти и газа;',
act26:'объектов переработки нефти, газа и углеводородного сырья;',
act27:'объектов хранения, распределения и реализации нефтепродуктов;',
act28:'объектов хранения, распределения и реализации газа;',
act29:'других объектов, входящих в инфраструктуру нефтедобычи, трубопроводного транспорта, промышленных и гражданских сооружений;',
act30:'систем противопожарной и электрохимической защиты;',
act31:'средств связи, электро-, тепло-, газоснабжения, систем кондиционирования и других инженерных сетей;',
act32:'автоматизированных систем контроля и управления технологическими процессами и объектами;',
act33:'мероприятий по предотвращению загрязнения окружающей среды нефтью и нефтепродуктами, энергосбережению и охране труда.',
act34:'ТЕХНИКО-ЭКОНОМИЧЕСКИЕ ОБСЛЕДОВАНИЯ:',
act35:'технико-экономические расчеты;',
act36:'технико-экономические обоснования инвестиций.',
act37:'ТЕХНИЧЕСКИЕ ОБСЛЕДОВАНИЯ:',
act38:'существующих объектов нефтегазового комплекса с оценкой их воздействия на окружающую среду;',
act39:'разработка рекомендаций по ремонту, реконструкции и модернизации обследуемых объектов нефтегазового комплекса.',
act40:'ТЕХНИЧЕСКИЙ И АВТОРСКИЙ НАДЗОР ЗА СТРОИТЕЛЬСТВОМ',
act41:'',
act42:'РАЗРАБОТКА НОРМАТИВНОЙ, ОБЗОРНО-АНАЛИТИЧЕСКОЙ ДОКУМЕНТАЦИИ',
act43:'',
act44:'',
act45:'',
act46:'ИНЖИНИРИНГОВЫЕ УСЛУГИ:',
act47:'подготовка документации и проведение тендеров;',
act48:'получение и оформление исходных данных;',
act49:'составление технических условий;',
act50:'подготовка документации и выполнение согласований;',
act51:'поставка оборудования для нефтегазовой отрасли;',
act52:'управление строительством, реализация «под ключ» отдельных объектов нефтегазового комплекса, промышленного и гражданского строительства.',
act53:'',


cert1:'СЕРТИФИКАТЫ',

cert2:'Сертификат СТ РК OHSAS 18001:2007 «Система менеджмента профессиональной безопасности и здоровья», выданный ТОО «Казахстанский Центр Сертификации».',

cert3:'Сертификат СТ РК ISO 14001:2015 «Система экологического менеджмента», выданный ТОО «Казахстанский Центр Сертификации».',

cert4:'Сертификат СМК ISO 9001:2008 «Комплекс инженерных услуг для строительства объектов нефтегазовой отрасли и сопутствующей инфраструктуры», выданный Компанией SGS Systems & Services Certification',


cert5:'ЛИЦЕНЗИИ',

cert6:'Государственная лицензия 14016989 Ⅰ-й (первой) категории (генеральная) от 10.11.2014 г. ',
cert61:'на проектирование, выданная Комитетом по делам строительства и жилищно-коммунального хозяйства и управления земельными ресурсами. Министерство национальной экономики Республики Казахстан.',

cert7:'Государственная лицензия 14001279 (генеральная) от 04.02.2014 г. ',
cert71:'на проектирование (технологическое) и (или) эксплуатация горных (разведка, добыча полезных ископаемых), нефтехимических, химических производств, проектирование (технологическое) нефтегазоперерабатывающих производств, эксплуатация магистральных газопроводов, нефтепроводов, нефтепродуктопроводов, выданная Министерством нефти и газа Республики Казахстан. Комитет государственной инспекции в нефтегазовом комплексе Министерства нефти и газа Республики Казахстан.',

cert8:'Лицензия 01625Р (генеральная) от 23.01.2014 г. ',
cert81:'на выполнение работ и оказание услуг в области охраны окружающей среды, выданная Министерством окружающей среды и водных ресурсов Республики Казахстан. Комитет экологического регулирования и контроля Министерства окружающей среды и водных ресурсов Республики Казахстан.',

cont0:'Схема проезда:',
cont1:'Республика Казахстан',
cont2:'г. Алматы, 050052,',
cont3:'мкр. Таугуль-3,',
cont4:'ул. Жантурина, 23',
cont5:'Тел.: +7 (727) 239 12 33',
cont6:'Тел.: +7 (727) 239 77 21',
cont7:'Тел.: +7 (727) 239 77 24',
cont8:'E-mail: secretary@mg-eng.kz',



      }, {
        						
        menu1:'Бас бет',
        menu2:'Компания туралы',
        menu3:'Басқару',
        menu4:'Жобалар',
        menu5:'Қызмет',
        menu6:'Сертификаттар және Лицензиялар',
        menu7:'Байланыстар',

        menu8:'Тілді таңдау',
        text01:"Әлемде ең",
        text02:"заманауи технологиялар...",
        text03:"тиімді талдамалар...",
        text04:" және сенімді серіктестер бар",


        text1: "Сіздердің көбіңіз бүгін біздің компаниямыз туралы алғаш рет естиді, ал бізбен ынтымақтасып келе жатқан адамдар, мүмкін, жасаған таңдауының дұрыс екеніне тағы да бір рет көз жеткізер.",

        text2: "Жұмыс істеген уақыт ішінде біз белгілі бір табыстар мен жетістіктерге қол жеткіздік, өз қызметтерімізді ұсынатын нарықты кеңейттік. Біздің ынтымақтастығымыздың шекаралары қазір отандық серіктестерді де, шетелдік серіктестерді де қамтиды.",
        
        text3: "Ынтамыз, жұмысқа берілгендігіміз, білікті қызметкерлеріміз, компанияға деген адалдығымыз бен тапсырыс берушінің мүдделеріне қамқорлық жасау – алға қойылған мақсаттарға қол жеткізудің жолы, міне, осы.",
        
        text4: "Сіздерді біздің тәжірибемізбен және өндірістік ресурстарымызбен танысуға шақырамыз және «MG Engineering инженерлік фирмасы» Сіздердің алға қойған міндеттеріңізді табысты жүзеге асыруда пайдалы болатынына сенім білдіреміз.",
        
        text5: "Біз барлық қызығушылық танытқан компаниялармен ынтымақтасуға дайынбыз және өзара пайдалы серіктестік қарым-қатынастарды құруда және оларды нығайтуда барынша қолдау көрсететін боламыз.",
        
        text6: "Бизнесте табысқа қол жеткізіңіздер деген ақ тілектермен",
        
        text7: "«MG Engineering инженерлік фирмасы» ұжымы",

        about1:" «MG Engineering инженерлік фирмасы» ЖШС мұнай-газ және құрылыс салаларында ұзақ уақыт жұмыс істеген мамандар тобының бастамасымен 2002 ж. тамыз айында құрылды. 2013 ж. желтоқсан айына дейін компания «Мұнай Графика» деген атаумен белгілі болды, бірақ қайта құрылымдау аяқталғаннан кейін атауы өзгертіліп, кәсіби қызметінің негізгі бағытын бейнелейтін жаңа атаумен жұмысын жалғастырды.",

        about111:"«MG Engineering инженерлік фирмасы» инженерлік-техникалық талдамалар мен жобалау, материалдық-техникалық қамтамасыз ету мен құрамдау, мұнай-газ құрылыстары мен кәсіпорындарының құрылыс өндірісін басқару саласында маманданады.",

        about2:"Негізгі мақсаты – тапсырыс берушінің барлық талаптарын қамтамасыз ететін және қанағаттандыратын инженерлік қызметтер кешенін сапалы түрде орындау (барынша қысқа және кепілдік етілген мерзім ішінде).",

        about3:"Алға қойылған мақсаттарға қол жеткізу үшін «MG Engineering инженерлік фирмасы» ЖШС-ның қалыптасқан әлеуеті бар. Өз жұмысымызда біз барлық қол жетерлік мүмкіндіктер мен құралдарды пайдаланамыз, соның ішінде:",

        about4:"жаңа технологияларды қолдану;",
        about5:"қолданыстағы, сертификатталған сапаны басқару жүйесі;",
        about6:"қызметерлердің кәсіби деңгейі мен біліктілігін әрдайым көтеріп отыру;",
        about7:"инновациялық тәсілдер мен заманауи техникалық шешімдер;",
        about8:"жобалауды тиімді басқару;",
        about9:"бұрынғы жүзеге асырылған жобалардың нақты тәжірибесін пайдалану.",
        about10:"Нарық жағдайында жұмыс істей отырып және бәсекеге қабілеттілікті көтерудің қажет екенін ұғына отырып, біз көрсететін қызметтеріміздің сапасын әрдайым жақсартып отыруға үлкен мән береміз. Сапа стандарттарын сақтай отырып, мерзімді барынша қысқарту үшін «MG Engineering инженерлік фирмасы» ЖШС жобалаудағы заманауи технологияларды кең ауқымда пайдаланады.",

        about11:"Көптеген маңызды жобаларды жүзеге асырып, біз өз қызметтеріміз ұсынылатын нарықты едәуір кеңейттік те, онда белгілі бір тауашаны иелендік. Біздің ынтымақтастығымыздың шекаралары қазір отандық серіктестерді де, шетелдік серіктестерді де қамтиды.",

        about12:"Табысты қызметтің өлшемдері:",

        about13:"тапсырыс берушінің біздің қызметтерімізге қызығушылық танытуы;",
        about14:"көрсетілетін қызметтердің тізімін анық тұжырымдау;",
        about15:"орындалатын жұмыстардың талдау мен жобалаудан бастап нысанды «кілтке дейін» әдісімен тапсыруға дейінгі толық көлемі;",
        about16:"мердігерлік жұмыстар мен қызметтерді мұқият жоспарлау және орындалуын бақылау;",
        about17:"жобаны сатыларға бөлу;",
        about18:"тапсырыс беруші-серіктеспен жұмыс істеу барысында тығыз өзара әрекеттесу;",
        about19:"тапсырыс берушінің үміттерінің нақтылығы және орындылығы;",
        about20:"ұжымның әрбір мүшесінің алға қойылған міндеттер мен мақсаттарды анық ұғынуы;",
        about21:"еңбекқор, білікті, жұмысты барынша жақсы орындауға бет қойған қызметкерлер.",

        
        
        upr1:'Қадағалау кеңесі',
        upr2:'Миндеев Андрей Ноелиевич',
        upr3:'ЖШС «MG Engineering» Бақылау кеңесінің төрағасы',
        upr4:'Білімі:',
        upr5:'Ленинград мемлекеттік университеті;',
        upr6:'Алматы сәулет-құрылыс институты.',
        upr7:'Кәсіби тәжірибе:',
        upr8:'Бірқатар құрылыс-монтаждау және жобалау ұйымдарын басқарды.',
        upr9:'MG Engineering негізін қалаушылардың бірі',
        upr10:'Сабыркулова Юлия Каировна',
        upr11:'Бақылау кеңесінің төрағасы, ЖШС «MG Engineering» басқарушы серіктесі',
        upr12:'Білімі:',
        upr13:'Қазақ мемлекеттік сәулет-құрылыс академиясы;',
        upr14:'Санкт-Петербург мемлекеттік университеті.',
        upr15:'Кәсіби тәжірибе:',
        upr16:'Көлік кәсіпорындарын басқару, жоспарлау және экономикасы.',
        upr17:'Кәсіпкерлік қызмет.',
        upr18:'2002 жылы тамызда ол Munai Graphics инжинирингтік компаниясын құрды.',
        upr19:'Тример Карстен Франк',
        upr20:'Бақылау кеңесінің төрағасы, ЖШС «MG Engineering» басқарушы серіктесі',
        upr21:'Білімі:',
        upr22:'Губкина И.М. атындагы Мәскеу мұнай және газ институты.',
        upr23:'Кәсіби тәжірибе:',
        upr24:'Мұнай-газ құбырлары құрылыстары мен құрылыстарын салуға арналған ірі халықаралық жобаларға қатысты.',
        upr25:'Қазақстандағы, Ресейдегі, Шығыс Еуропадағы ірі бөлімшелердің бастығы.',
        upr26:'',
        upr27:'Жук Иван Витальевич',
        upr28:'Бас директор',
        upr29:'Білімі:',
        upr30:'М.Тынышбаев атындағы Қазақстан көлік және коммуникация академиясы',
        upr31:'Кәсіби тәжірибе:',
        upr32:'Ол мұнай-газ қондырғыларының өндірістік-техникалық жабдықтау, жабдықтар мен технологиялық жүйелерді жабдықтау және қызмет көрсету ұйымдарын басқарды. SGC Stroygazcosulting, АҚ «Алматыпрострой», BSI Indusries Inc.',
        upr33:'Михайловский Игорь Юрьевич',
        upr34:'',
        upr35:'Бас директордың кеңесшісі',
        upr36:'',
        upr37:'Білімі:',
        upr38:'Томск политехникалық институты;',
        upr39:'Губкин И.М. атындағы Мәскеу мемлекеттік мұнай және газ университетінің біліктілікті арттыру оқу-зерттеу орталығы.',
        upr40:'Кәсіби тәжірибе:',
        upr41:'Ол энергетикалық кәсіпорындарда жоспарлау, экономикалық, келісімшарттық жұмыстармен айналысқан. Жетекшілік ететін жобалау ұйымдары',
        upr42:'MG Engineering негізін қалаушылардың бірі',
        upr43:'Миндеев Александр Андреевич',
        upr44:'Коммерциялық директор',
        upr45:'',
        upr46:'Білімі:',
        upr47:'Қ.И. Сәтбаев. атындағы Қазақ ұлттық техникалық университеті.',
        upr48:'Губкин И.М. атындағы Мәскеу мемлекеттік мұнай және газ университетінің біліктілікті арттыру оқу-зерттеу орталығы.',
        upr49:'Кәсіби тәжірибе:',
        upr50:'«БЕК» корпорациясы - тұрғын үй және азаматтық объектілер құрылысын ұйымдастыру және басқару. ЖШС «KITNG», ЖШС «Munay Graphics». Жобаларды әзірлеуге және Қазақстаннан Қытайға магистральды мұнай-газ құбырларын салуға қатысты. Мұнай-газ кешені кәсіпорындары мен объектілерін жобалау жұмыстарының бастығы.',
        upr51:'Лысяк Владимир Петрович',
        upr52:'Техникалық директор',
        upr53:'Білімі:',
        upr54:'Қ.И. Сәтбаев атындағы Қазақ ұлттық техникалық университетінің Мұнай-газ саласының машиналары мен жабдықтары.',
        upr55:'Кәсіби тәжірибе:',
        upr56:'«Имсталкон» АҚ құрылысын ұйымдастыруды басқару. Мұнай-газ кешені нысандарын жобалау АҚ «GeoKOD», ЖШС «Munay Graphics», ЖШС «KITNG», БК «Қазгермұнай», АҚ «Торғай Петролеум»мұнай-газ кен орындарының объектілері мен құрылымдарын пайдалану.',
        upr57:'Аймақтық өкілдер',
        upr58:'Гуменюк Виктор Федорович',
        upr59:'Нұрсұлтан қаласының өкілі',
        upr60:'Білімі:',
        upr61:'Целиноград инженерлік-құрылыс институты',
        upr62:'Кәсіби тәжірибе:',
        upr63:'Магистральдық мұнай өнімдері құбырларының желілік құрылыстарын салуға қатысты. Мемкомнефтепродукт жүйесінің құрылыс бөлімдерін басқарды. Жеке құрылыс-монтаж компаниясының басшысы және иесі.',
        upr64:'Гегамян Армен Эвагович',
        upr65:'Орал, Атырау, Самара қалаларының өкілі',
        upr66:'Білімі:',
        upr67:'КСРО МВМ ішкі әскерлерінің Владикавказ жоғары әскери командалық мектебі; Қазақстан Республикасы Қорғаныс министрлігінің Алма-Ата әскери академиясы.',
        upr68:'Кәсіби тәжірибе:',
        upr69:'Әскери қызметі кезінде командалық-басқарушылық құрамда әр түрлі лауазымдарда болды. Демобилизациядан кейін - жеке кәсіпкер. Сервистік-құрылыс компаниясының иесі.',
        upr70:'Курбангалиев Бактыгали',
        upr71:'Ақтөбе қаласының өкілі',
        upr72:'Білімі:',
        upr73:'Нөкис жол техникумы;',
        upr74:'Букетов атындағы Қарағанды ​​мемлекеттік университеті',
        upr75:'Кәсіби тәжірибе:',
        upr76:'Ол Агроөнеркәсіптік кешен кәсіпорындарында жұмыс істеді, бірқатар жеке құрылымдарды басқарды. ЖШС «MG Engineering» өкілі',
                
                
                
        
        
        
        proj1:'Біздің компания Ресей, Украина, Латвия, Канада және Германия жобалау институттарымен тұрақты негізде жұмыс істейді.',
        proj2:'2002 жылдан бастап компания мұнай-газ кәсіпорындарының, нысандары мен ғимараттарының құрылысының күрделілігі әртүрлі 150-ден астам жобасын жүзеге асыруға қатысты.',
        proj3:'Әрбір жүзеге асырылатын жоба біздің компаниямыздың стратегиялық жоспарына сәйкес келеді және Тапсырыс берушінің қажеттеліктерін барынша қанағаттандыруды негізге алады. Әрі оның жекелеген тілектері мен ескертулері болашақтағы жұмыс үрдісінде түзетіле отырып, зерттелінеді, талданады және ескеріледі.',
        proj4:'НЕГІЗГІ ЖОБАЛАРЫМЫЗ:',
        proj5:'Тапсырыс беруші «ҚазГерм-Сервис» ЖШС',
        proj6:'АГССС ғимараты: Шымкент қаласы, ул. Қайықалды батыр даңғылы, 19/1',
        proj7:'Тапсырыс беруші «Сағыз Петролеум» ЖШС',
        proj8:'Ақтөбе облысының Байғанин ауданында 20 адамға арналған «Копа» ПСП- ға және СҚО-дан МҚК-дан магистральды мұнай құбырымен Коп қабылдау пунктін салу.',
        proj9:'Тапсырыс беруші "ProsperaResources"ЖШС',
        proj10:'«Saghiz Oil Terminal» (NNT) үшін жобалық-сметалық құжаттаманы түзету',
        proj11:'Тапсырыс беруші "ПетроКазахстанойл Продактс" ЖШС',
        proj12:'«Шымкен мұнай өңдеу зауытында булардың қалпына келтірілуімен мұнай құю қондырғысының құрылысы» жобасы бойынша құрылыс-монтаждау жұмыстары кезінде қадағалау жүргізу.',
        proj13:'Тапсырыс беруші Қытайдың Мұнай және газ өнеркәсіп корпорациясы',
        proj14:'«ETBE / MTBE және ұнтақ полипропиленді өндіру зауытының құрылысы» объектінің техникалық-экономикалық негіздемесі (техникалық-экономикалық негіздеме).',
        proj15:'Тапсырыс беруші "Кнауф Гипс Қапшағай" ЖШС',
        proj16:'Зауытты гипсокартондар мен құрғақ құрылыс қоспаларын өндіруге газбен қамтамасыз ету',
        proj17:'Тапсырыс беруші ЖШС «KAZPETROLEUM TECHNOLOGIES»(Казпетролеумтехнолоджис)',
        proj18:'Атырау мұнай өңдеу зауыты» ЖШС өндірістік қондырғыларын басқару құрылғыларымен жабдықтау »жобалау-іздестіру жұмыстары.',
        proj19:'Тапсырыс беруші «CaspiOilGas» ЖШС',
        proj20:'"Ракушечное" мұнай кен орнын барлау және сынақ жұмыстары кезінде орналастыру."Ракушечное" мұнай кен орнындағы мұнай дайындау станциясы.',
        proj21:'Тапсырыс беруші «Alties Petroleum International B.V.»',
        proj22:'Барлау және өндіру кезеңінде Бесболек мұнай кен орнын игеру;',
        proj23:'«Ақжар» кен орнынан АҚ «ҚазТрансОйл» магистральдық мұнай құбырына дейін бекіту нүктесіне дейін мұнай құбырын салу',
        proj24:'«Қарсақ» мұнай қабылдау және тасымалдау пункті;',
        proj25:'Қарсақ қабылдау пунктінің жұмысының технологиялық регламенттері;',
        proj26:'Қолданыстағы Жарқамыс қосалқы станциясынан жобаланып жатқан «Ақжар» қосалқы станциясына дейін 35 киловольт кернеуі бар электр берудің әуе желісін жобалау',
        proj27:'Тапсырыс беруші ЖШС «Бузачи Нефть»',
        proj28:'«Қаратұрын Теңіз» және «Қаратұрын Шығыс» газ-мұнай кен орындарында ілеспе шығарылатын газды кәдеге жарату бағдарламасын әзірлеу және жүзеге асыру.',
        proj29:'Тапсырыс беруші АҚ «Казхиммонтаж холдинг» (Agip KCO)',
        proj30:'Шығыс Қашаған мұнай-газ кен орнын жайластыру. Құрылысшылар қалашығын инженерлік қамтамасыз ету алаңшасында су сақтауға арналған көлемі 1500м³; 1800м³; 2200м³ және 5800м³ тік болат сұйыққоймалар.',
        proj31:'Тапсырыс беруші ЖШС «Казахский институт транспорта нефти и газа»',
        proj32:'ЖШС «KITNG» акционерлерінің өтініші мен нұсқауы бойынша желтоқсан айынан бастап. 2007 жылдан 2011 жылдың маусымына дейін MG Engineering компаниясының бір топ басшылары мен бас мамандары жобалау жұмыстарының кешенін жүзеге асыру үшін «Тиімді ұйымды жобалау» жобалық басқару бойынша жұмыстардың маңызды кезеңдерін жүзеге асырды:',
        proj33:'«Қазақстан - Қытай магистральды газ құбырының құрылысы»;',
        proj34:'«Кеңқияқ - Құмкөл магистральды мұнай құбырының құрылысы»',
        proj35:'Тапсырыс беруші «Big Sky Energy Corp.»',
        proj36:'«Теңіз» мұнай кен орнын жайластыру.',
        proj37:'Тапсырыс беруші Lancaster Petroleum ( АҚ «ККМ Operating Company»)',
        proj38:'«Көкжиде-Тұз үсті» мұнай кен орнының ұңғымаларынан өнім жинау және тасымалдау;',
        proj39:'«Көкжиде-Тұз үсті» мұнай кен орнында мұнай дайындау цехін кеңейту;',
        proj40:'қызмет көрсететін жұмысшылар тұратын жаңа вахталық қыстақ;',
        proj41:'АҚ «ККМ Operating Company» өнеркәсіптік нысандарында жинау, тасымалдау және дайындау кезінде мұнай мен газдың технологиялық ысыраптары» нормативтік-техникалық құжаттамасын әзірлеу.',
        proj42:'Тапсырыс беруші АҚ «CNPC-Актобемунайгаз»',
        proj43:'«Бестамақ» теміржол станциясында мұнайды автоматты герметикалық құю және қотару жүйесінің нысандары және құрылыстары.',
        proj44:'Тапсырыс беруші АҚ «Имсталькон»',
        proj45:'«Қаражанбас» газ-мұнай кен орнында орталық мұнай дайындау пунктінде технологиялық тік болат сұйыққоймаларды салу;',
        proj46:'«Тенгиз» аралық сорғы станциясының сұйыққоймалық паркін қайта құру;',
        proj47:'«Тенгиз» мұнай кен орнында тазартылған қышқыл су мен жалпы техникалық қызмет көрсетудің сұйыққоймалық паркі.',
        proj48:'Тапсырыс беруші «Каражанбасмунай» АҚ',
        proj49:'топтық өлшемдік қондырғыларды орнату;',
        proj50:'«Қаражанбас» газ-мұнай кен орнында жаңа технологиялық нысандарды салу;',
        proj51:'«Қаражанбас» газ-мұнай кен орнында сықпа сорғы станциясының сұйыққоймалық паркін кеңейту;',
        proj52:'Орталық мұнай дайындау пунктін кеңейту.',
        proj53:'Тапсырыс беруші АҚ «Каспий Нефть ТМЕ»',
        proj54:'«Әлібек Оңтүстік» кен орнының мұнай-газ конденсаттық ұңғымаларының өнімін жинау және тасымалдау;',
        proj55:'«Әлібек Оңтүстік» кен орнында мұнай құю пунктін кеңейту;',
        proj56:'«Әлібек Оңтүстік» кен орнында су тартуды орнату;',
        proj57:'«Әлібек Оңтүстік» кен орнында ішкі кәсіптік жолдар;',
        proj58:'«Кеңқияқ» ПС-110/35/10 кВ аралық станциясын және қуатпен қамтамасыз етудің басқа да құрылыстары мен құрылғыларын қайта құру.',
        proj59:'Тапсырыс беруші АҚ «Конденсат»',
        proj60:'ГП-3-Орынбор тазартылмаған газдың газ құбыры учаскесін жөндеу және алмастыру;',
        proj61:'Орал каласының Фирмалық жанармай құю станциясының тұжырымдамалық жобасын әзірлеу.',
        proj62:'Тапсырыс беруші АҚ «МонтажСпецСтрой»',
        proj63:'«Теңіз суын тарту қондырғысын кеңейту» тендерлік құжаттамасын әзірлеу;',
        proj64:'ЖШС «Тенгизшевройл» уақытша офисінің блок-модульдік ғимараты;',
        proj65:'«Дунга» газ-мұнай кен орнындағы газтурбиндік электрстанциясы.',
        proj66:'Тапсырыс беруші ЖШС «BN Мунай»',
        proj67:'Ақтөбе облысындағы «Кзылой» газ кен орнын жайластыру;',
        proj68:'Ішкі кәсіптік газ жинайтын құбырлар.',
        proj69:'Тапсырыс беруші «Dostyk Refinery» ЖШС',
        proj70:'«Достық-2» ақшыл түсті мұнай өнімдерінің экспорттық-жүк ауыстырып тиейтін теміржол мұнай базасы;',
        proj71:'«Достық» экспорттық-жүк ауыстырып тиейтін теміржол мұнай базасын қайта құру.',
        proj72:'Тапсырыс беруші ЖШС «Prosystems Petroleum»',
        proj73:'Алматы қаласының сервистік жанармай құю станциясын қайта құру.',
        proj74:'Тапсырыс беруші ЖШС «Sinooil»',
        proj75:'Нұр-Сұлтан қ. мұнай өнімдері базасын қайта құру;',
        proj76:'Сервистік жанармай құю станциясы, Алматы облысы, Қарасай ауданы, Қаскелең-Шамалған трассасы;',
        proj77:'Сервистік жанармай құю станциясы, Алматы облысы, Еңбекшіқазақ ауданы;',
        proj78:'Сервистік жанармай құю станциясы, Алматы облысы, Жамбыл ауданы, Ұзынағаш ауылы.',
        proj79:'Тапсырыс беруші ЖШС «Артис Оверсис С.А. Казахстан»',
        proj80:'Мұнай терминалын кеңейту. Ақтау қаласындағы теңіз айлағы.',
        proj81:'Тапсырыс беруші ЖШС «Жаикмунай»',
        proj82:'Чинарев мұнай-газ конденсаттық кен орнын жайластырудың нысандары мен құрылыстары.',
        proj83:'Тапсырыс беруші ЖШС «Казахойл Актобе»',
        proj84:'«Қожасай» мұнай-газ конденсаттық кен орнын сынамалық пайдалану кезеңінде жайластыру;',
        proj85:'«Әлібекмола» мұнай-газ конденсаттық кен орнындағы мұнай қабылдау және дайындау пункті;',
        proj86:'«Әлібекмола» кен орнындағы пайдаланған өнеркәсіптік суды қыртысқа қотару жолымен кәдеге жарату жүйесі;',
        proj87:'«Әлібекмола» мұнай-газ конденсаттық кен орнының солтүстік бөлігінде қыртыс қысымын сүйемелдеу жүйесі;',
        proj88:'«Әлібекмола» кен орнында мұнай дайындау пунктін пайдалану бойынша технологиялық тәртіпті әзірлеу;',
        proj89:'«Кожасай» кен орнындағы қуатпен қамтамасыз ету жүйесі;',
        proj90:'«Әлібекмола» кен орнының Орталық мұнай мен газ дайындау пунктін электрмен қамтамасыз ету үшін «Әлібек Оңтүстік» аралық станциясымен кернеуі алты киловольттық электр берудің әуе желісі.',
        proj91:'Тапсырыс беруші ЖШС «Кен-Сары»',
        proj92:'«Арыстан» мұнай кен орнын барлау және сынамалық пайдалану кезеңінде жайластыру. І-ші, ІІ-ші жіберімді кешен;',
        proj93:'«Арыстан» кен орнын жайластыру. III-ші жіберімді кешен;',
        proj94:'«Арыстан» кен орнының мұнай дайындау пункті.',
        proj95:'Тапсырыс беруші ЖШС «Казахстанско-Китайский Трубопровод»',
        proj96:'Қазақстан-Қытай мұнай құбырының құрылысы. Кеңқияқ-Құмкөл учаскесі. «Біріктірілген апаттық-қалпына келтіру пункті».',
        proj97:'Тапсырыс беруші ЖШС «МегаТрансАзия»',
        proj98:'Мұнай базасының өндірістік қуаттарын кеңейту. Алматы облысы, Алакөл ауданы, Бескөл станциясындағы мұнай өнімдерін өңдеу цехі;',
        proj99:'Қуаттылығы жылына 1 100 000 т құрайтын мұнай өңдеу зауыты;',
        proj100:'Қуаттылығы жылына 600 000 т құрайтын мұнай өңдеу зауыты.',
        proj101:'Тапсырыс беруші ЖШС «НТ Нурлы Мунай»',
        proj102:'«НТ Нурлы Мунай» мұнай қабылдау-тапсыру пункті.',
        proj103:'«Сагиз Петролеум Компани» ЖШС',
        proj104:'«Ebity» қабылдау-тапсыру пункті құрылысының құрылыс-монтаж жұмыстарының көлемдері мен құнын бағалау. Тосқауылдық құбыр, Ақтөбе облысы, Байғанин ауданындағы «Кеңқияқ-Атырау» магистральдық мұнай құбырына қосылумен бірге.',
        proj105:'Тапсырыс беруші ЖШС «Саутс Ойл»',
        proj106:'Кеңқияқ-Құмкөл магистральдық мұнай құбырына қосыла отырып, «Кеңлік» мұнай кен орнында мұнай мен мұнай құбырын есепке алудың коммерциялық торабының құрылысы.',
        proj107:'Тапсырыс беруші ЖШС «ТЭК Казахстан»',
        proj108:'Достық, Үштөбе, Қостанай теміржол станцияларында локомотивтерді жабдықтаудың отын қоймаларын қайта құру.',
        proj109:'Тапсырыс беруші «Умай-Маркет» ЖШС',
        proj110:'Арыс қ. ақшыл түсті мұнай өнімдерінің үлестіргіш теміржол терминалы;',
        proj111:'Техникалық сүйемелдеу және құрылысты басқару.',
        proj112:'Тапсырыс беруші «Эрнст энд Янг консультационные услуги» ЖШС',
        proj113:'Қазақстан Республикасында 95 автомобильдік газ толтырғыш компрессорлық станцияларын салу мен пайдаланудың техникалық-экономикалық негіздемесін әзірлеу.',
        proj114:'және көптеген басқа жобалар, жұмыстар мен қызметтер',


      
       


act01:'Компанияның қызметі мұнай-газ саласының жаңа нысандарының, ғимараттарының және кәсіпорындарының құрылысының, жұмыс істеп тұрған нысандарының, ғимараттарының және кәсіпорындарының қайта құру және жаңғыртуының инженерлік және жобалық жұмыстарының кешенін сапалы түрде орындауға бағытталған.',
act02:'  Компания ынтымақтасуға ашық, Қазақстанда да, одан тысқары жерлерде де мұнай бен газды шығару, дайындау, тасымалдау жобаларын тиімді жүзеге асыру саласындағы кез-келген өзара пайдалы ұсыныстарды қабылдауға дайын.',

        
act1:' КЕШЕНДІ ЖОБАЛАУ:',

act2:'мұнай-газ конденсаттық кен орындарын жайластыруды:',
act3:'- ұңғымаларды жайластыруды;',
act4:'- ұңғыма өнімін кәсіптік жинау жобаларын;',
act5:'- өлшеу қондырғыларын;',
act6:'- қыртыстық суды бастапқы тастау қондырғыларын;',
act7:'- қыртыс қысымын сүйемелдеу жүйелерін;',
act8:'- бұталы сорғы және компрессорлық станцияларды;',
act9:'мұнай мен газды тауарлық күйге дейін дайындау нысандарын:',
act10:'- мұнай мен газ дайындау қондырғыларын;',
act11:'- түсетін өнімді қабылдау және есепке алу қондырғыларын;',
act12:'- мұнайды бөлу, соның ішінде газсыздандыру, сусыздандыру, тұзсыздандыру',
act13:'- және демеркаптандыру қондырғыларын;',
act14:'- газ тазарту және кептіру қондырғыларын;',
act15:'- алдын ала газ дайындау қондырғыларын (АГДҚ);',
act16:'- кешенді газ дайындау қондырғыларын (КГДҚ);',
act17:'- мұнай мен газды тазартуға ілесе жүретін ерітінділер мен құрауыштарды',
act18:'-дайындау қондырғыларын;',
act19:'- қыртыстық суды тазарту қондырғыларын;',
act20:'- технологиялық сорғы және компрессорлық станцияларды;',
act21:'- дайын өнімді жинаудың сұйыққоймалық парктерін;',
act22:'- дайын өнімді қотаратын сорғы және компрессорлық станцияларды;',
act23:'мұнай мен газ тасымалдау нысандары мен құрылыстарын:',
act24:'- кез-келген мақсаттағы магистральдық құбырларды;',
act25:'- мұнай мен газдың кәсіптік, технологиялық, үлестіргіш құбырларын;',
act26:'мұнайды, газды және көмірсутек шикізатын өңдеу нысандарын;',
act27:'мұнай өнімдерін сақтау, үлестіру және сату нысандарын;',
act28:'газды сақтау, үлестіру және сату нысандарын;',
act29:'мұнай шығару, құбырлық тасымалдау, өнеркәсіптік және азаматтық құрылыстар инфрақұрылымына кіретін басқа да нысандарды;',
act30:'өртке қарсы және электрлік химиялық қорғау жүйелерін;',
act31:'байланыс, электрмен, жылумен, газбен қамтамасыз ету құралдарын, кондиционерлеу жүйелерін және басқа да инженерлік желілерді;',
act32:'технологиялық үрдістер мен нысандарды бақылау мен басқарудың автоматтандырылған жүйелерін;',
act33:'қоршаған ортаның мұнаймен және мұнай өнімдерімен ластануының алдын алу, электрмен қамтамасыз ету және еңбекті қорғау бойынша шараларды.',
act34:'ТЕХНИКАЛЫҚ-ЭКОНОМИКАЛЫҚ ЗЕРТТЕУЛЕР:',
act35:'техникалық-экономикалық есептеулер;',
act36:'инвестициялардың техникалық-экономикалық негіздемелері.',
act37:'ТЕХНИКАЛЫҚ ЗЕРТТЕУЛЕР:',
act38:'мұнай-газ кешенінің қолданыстағы нысандарын олардың қоршаған ортаға әсерін бағалай отырып зерттеу;',
act39:'мұнай-газ кешенінің зерттеліп отырған нысандарын жөндеу, қайта құру және жаңғырту бойынша ұсыныстар әзірлеу.',
act40:'',
act41:'',
act42:'ҚҰРЫЛЫСТЫ ТЕХНИКАЛЫҚ ЖӘНЕ АВТОРЛЫҚ ҚАДАҒАЛАУ',
act43:'',
act44:'НОРМАТИВТІК, ШОЛУ-ТАЛДАМАЛЫҚ ҚҰЖАТТАМАСЫН ӘЗІРЛЕУ',
act45:'',
act46:'ИНЖИНИРИНГТІК ҚЫЗМЕТТЕР:',
act47:'құжаттама дайындау және тендерлер өткізу;',
act48:'бастапқы деректерді алу және рәсімдеу;',
act49:'техникалық шарттарды жасау;',
act50:'құжаттама дайындау және келісулерді орындау;',
act51:'мұнай-газ саласы үшін жабдық жеткізу;',
act52:'құрылысты басқару, мұнай-газ кешенінің, өнеркәсіптік және азаматтық құрылыстың жекелеген нысандарын «кілтке дейін» әдісімен жүзеге асыру.',
act53:'',




cert1:'СЕРТИФИКАТТАР',

cert2:'Сертификат ҚР СТ ИСОС 18001:2007 «Еңбектіқорғаужәнеденсаулықтыбасқаружүйесі», «Қазақстандықсертификаттауорталығы» ЖШС берген.',

cert3:'Сертификат ҚР СТ ИСО 14001:2015 «Экологиялықменеджментжүйесі» ЖШС «Қазақстандықсертификаттауорталығы» ЖШС берген.',

cert4:'Сертификат СМЖ ISO 9001:2008 «Мұнай мен газ саласының құрылысына арналған инженерлік қызметтердің кешені және ілеспе инфрақұрылым», SGS Systems & Services Certification компаниясынан берілген.',


cert5:'ЛИЦЕНЗИЯЛАР',

cert6:'Мемлекеттік лицензия 14016989 (бірінші) санат (басты) 10.11.2014 ж. ',
cert61:'бастап жобалау қызметтерін орындауға, Құрылыс және тұрғын үй-коммуналдық шаруашылық істері және жер ресурстарын басқару комитетінен берілген. Қазақстан Республикасы ұлттық экономика министрлігі.',

cert7:'Мемлекеттік лицензия 14001279 (басты) 04.02.2014 ж. ',
cert71:'бастап тау – кен (пайдалы қазбаларды барлау, өңдіру), мұнай-химия, химия өндірістерін жобалау(технологиялық) және (немесе) пайдалану, мұнай-газ өндеу жобалау (технологиялық), магистральдық газ құбырларын пайдалану, Қазақстан Республикасының мұнай және газ минимтрлігінен берілген. Қазақстан Республикасы мұнай және газ министрлігі мұнай-газ кешеніндегі мемлекеттік инспекциялау комитеті.',

cert8:'Лицензия 01625Р (басты) 23.01.2014 ж. ',
cert81:'бастап қоршаған ортаны қорғау саласында жұмыстарын орындау және қызметтер көрсету, Қазақстан Республикасының Қоршаған орта және су ресурстары министрлігінен берілген. Қазақстан Республикасы Қоршаған орта және су ресурстары министрлігінің Экологиялық реттеу және бақылау комитеті.',


cont0:'Өту сызбасы:',
cont1:'Қазақстан Республикасы,',
cont2:'050052 Алматы қ.',
cont3:'Таугүл ауданы,',
cont4:'Жантурин к-сі, 23',
cont5:'Тел.: +7 (727) 239 12 33',
cont6:'Тел.: +7 (727) 239 77 21',
cont7:'Тел.: +7 (727) 239 77 24',
cont8:'E-mail: secretary@mg-eng.kz',
        
        
      }, {

           	 				
        menu1:'Home',
        menu2:'About company',
        menu3:'Management',
        menu4:'Projects',
        menu5:'Activities',
        menu6:'Certificates and Licenses',
        menu7:'Contacts',

        menu8:'Choose language',
        text01:"The most up-to-date technologies...",
        text02:"efficient solutions...",
        text03:"and reliable partners are",
        text04:"avaliable in the world",
           
  
  
        text1: "Today, many of you wlil get wise to our company for the first time, and those who cooperates with us wlil probably realize the right choice made one more time.",
  
        text2: "During the existence of our company, we have succeeded in getting certain achievements with the market of our services being expanded. The boundaries of our cooperation cover both local and foreign partners.",
        
        text3: "Initiative, dedication, qualified personnel, attachment to the company and customer interests care are the key to achieve the goals desired.",

        text4: "Please refer to our experience and production resources. We are expressing our assurance that MG Engineering Company can be helpful in successful implementation of the tasks you scheduled.",
        
        text5: "We are open for cooperation with all interested companies and wlil fully cooperate in buliding and empowering mutually beneficial partner relations.",
        
        text6: "With the best wishes in success in business,",
        
        text7: "MG Engineering Company Team",


    about1:"MG Engineering Company LLP has been formed in August, 2002 at the initiative of a group of specialists worked in oli and gas and construction branches of industry for a long time. Untli December, 2013, the company was known as Munai Grafika. However, after completion of the corporate restructuring, it has been renamed and continues operating under a new name reflecting the main trend of the professional activity.",

    about111:"MG Engineering company is specialized in engineering development and design, logistics and procurement, and management of oli and gas structures and enterprise construction.",

    about2:"The goal is a qualitative performance (at a maximum tight and guaranteed schedule) of a complex of engineering services ensuring and complying with all customer requirements.",

    about3:"To achieve the goals, MG Engineering Company LLP has a potential already formed. In our work, we apply all avaliable opportunities and tools including:",

    about4:"use of the best avaliable technologies;",
    about5:"quality management system operating and certified;",
    about6:"constant professional and qualification development of the staff;",
    about7:"innovative approaches and modern engineering solutions;",
    about8:"efficient management of design;",
    about9:"application of a practical experience of the previous projects implemented.",
    about10:"By operating in the market conditions and realizing a necessity to improve competitiveness, we are making much of the constant improvement of quality of the service provided. To reduce deadlines when complying with the quality standards, the MG Engineering Company LLP is using up-to-date technologies and design in full.",

    about11:"By implementing numerous serious projects, we have considerably expanded an offered market of our services. The boundaries of our cooperation cover both local and foreign partners.",

    about12:"Criteria of successful activity:",

    about13:"the customer interest in our services;",
    about14:"clear formulation of the services provided;",
    about15:"full scope of works performed from analysis and design to the facliity turnkey operation;",
    about16:"contractor works and services thorough planning and performance control;",
    about17:"division of project by stages;",
    about18:"close cooperation with a customer partner in the course of operations;",
    about19:"eality and justifiabliity of the customer expectations;",
    about20:"clear understanding of the tasks and goals in hand by every team member;",
    about21:"industrious and qualified personnel focused on the best work performance.",


    upr1:'Supervisory board',
    upr2:'Andrey Mindeyev',
    upr3:'Chairman of Supervisory Board MG Engineering company',
    upr4:'Education:',
    upr5:'Leningrad State University;',
    upr6:'Alma-Ata Architectural Institute',
    upr7:'Professional experience:',
    upr8:'Administered a number of construction and installation designer organizations.',
    upr9:'One of the MG Engineering company founders.',
    upr10:'Yuliya Sabyrkulova',
    upr11:'Member of Supervisory Board, managing partner of MG Engineering LLP',
    upr12:'Education:',
    upr13:'Kazakh Leading Academy of Architectural and Civil Engineering;',
    upr14:'ST-Petersburg State University.',
    upr15:'Professional experience:',
    upr16:'Administration, planning and economy of transportation enterprises.',
    upr17:'Entrepreneurial activities.',
    upr18:'Has founded “MunayGrafika” engineering company in August, 2002.',
    upr19:'Frank Karsten Triemer',
    upr20:'Member of Supervisory Board, managing partner of MG Engineering LLP',
    upr21:'Education:',
    upr22:'Gubkin’s institute of oil and gas, Moscow.',
    upr23:'Professional experience:',
    upr24:'Participated in the largest international projects on construction of and gas pipeline facilities and structures. Administered large sub-divisions and enterprises in Kazakhstan, Russian Federation and the Eastern Europe.',
    upr25:'Head of large divisions in Kazakhstan, Russia, Eastern Europe.',
    upr26:'',
    upr27:'Ivan Zhuk',
    upr28:'General Director',
    upr29:'Education:',
    upr30:'Kazakh Academy of Transport and Communications named after M. Tynyshpayev',
    upr31:'Professional experience:',
    upr32:'He was in charge of the organizations of production and technical equipment, supply and maintenance of equipment and technological systems of oil and gas facilities. SGC Stroygazcosulting, JSC Almatyprostroy, BSI Indusries Inc.',
    upr33:'Igor Mikhailovskiy',
    upr34:'',
    upr35:'General Director Advisor',
    upr36:'',
    upr37:'Education:',
    upr38:'Tomsk Polytechnical Institute.',
    upr39:'Training and Survey Center of Advanced Training of the Gubkin’s State University of Oil and Gas, Moscow.',
    upr40:'Professional experience:',
    upr41:'Was involved in the economic planning, contractual work at the energy industrial branch',
    upr42:'One of the MG Engineering company founders.',
    upr43:'Mindeyev Alexandr',
    upr44:'Commercial Director',
    upr45:'',
    upr46:'Education:',
    upr47:'Kazakh National Technical University K.I.Satpaev',
    upr48:'Training and Research Center of Advanced Studies of the Moscow State University of Oil and Gas. I.M.Gubkin. Design, construction, and operation of gas and oil pipelines and gas and oil storage tanks.',
    upr49:'Professional experience:',
    upr50:'“BEK” Corporation-organization and management of construction of housing and civil objects. LLP “KITNG”, LLP “MunayGrafika”. Participation in projects development and construction of main oil and gas pipelines Kazakhstan-China. Project manager of oil and gas complex enterprises and constructions.',
    upr51:'Lyssyak Vladimir',
    upr52:'Technical Director',
    upr53:'Education:',
    upr54:'Kazakh National Technical University K.I.Satpaev. Machines and equipment of oil and gas industry.',
    upr55:'Professional experience:',
    upr56:'Construction management of JSC “MunayGrafika” LLP “KITNG”. Operation of objects and constructions of oil and gas deposits of “JV Kazgermunai” LLP.',
    upr57:'Regional Representatives',
    upr58:'Viktor Gumenyuk',
    upr59:'Representative, Nursultan city',
    upr60:'Education:',
    upr61:'Tselinograd construction engineering institute.',
    upr62:'Professional experience:',
    upr63:'Participated in the construction of linear facilities of petroleum product trunk lines. Administered construction departments of the Goskomnefteprodukt system. Administrator and owner of a private construction and installation company.',
    upr64:'Armen Gegamyan',
    upr65:'Representative, Uralsk, Atyrau, Samara Education:',
    upr66:'Education:',
    upr67:'Vladikavkaz Higher Military Surveillance School of the SSR Interior Military Forces; Alma-Ata Military Academy under the Ministry of Defense of the RoK.',
    upr68:'Professional experience:',
    upr69:'He held various positions in command and control personnel during his military service. After demobilization - a private entrepreneur. Owner of a service and construction company.',
    upr70:'Baktygali Kurbangaliyev',
    upr71:'Representative, Aktobe',
    upr72:'Education:',
    upr73:'Nukus road transport training college;',
    upr74:"Buketov's State University Karaganda.",
    upr75:'Professional experience:',
    upr76:'He worked at the enterprises of the Agro-industrial complex, led a number of private structures. Representative of MG Engineering LLP',





    proj1:'Our company cooperates on a permanent basis with the design institutes of Russian, Ukraine, Latvia, Canada and Germany.',
proj2:'Since 2002, the company has participated in implementation of more than 150 projects on construction of oil and gas enterprises, facilities and structures.',
proj3:'Each project being implemented complies with the strategic plan of our company. It is based on a maximum satisfaction of the Client needs. However, his individual requests and comments are studied, analyzed and considered with further updates in the course of work.',
proj4:'MAJOR PROJECTS:',
proj5:'Client "KazGerm Service"',
proj6:'The construction of NGV-refuelling compressor station at the city Shymkent, st.KaykeldyBatyr building 19/1 LLP',
proj7:'Client LLP "Sagiz Petroleum"',
proj8:'Construction of Transfer and acceptance point Copa with the main pipeline from the CPF to the TAP "Copa" and camp field for 20 people in Bayganinskom district of Aktobe region',
proj9:'Client "Prospera Resources" LLP',
proj10:'Updating the design specifications and estimates for the “Oil loading terminal Sagiz” (OLT)',
proj11:'Client PetroKazakhstanOil Products LLP',
proj12:'Field supervision during construction and assembling works for the project “Construction of the oil single point loading with vapor recovery on Shymkent Refinery"',
proj13:'Client China oil corporation in technology and development',
proj14:'Project feasibility: Construction of a plant for the production of ETBE / MTBE and powder polypropylene.',
proj15:'Client KnaufGipsKapchagay LLP',
proj16:'Gas supply of the plant for the production of gypsum-cardboard sheets and dry construction mixtures',
proj17:'Client KAZPETROLEUM TECHNOLOGIES LLP (Kazpetroleumtechnologies)',
proj18:'Design and survey work "Equipping production facilities of Atyrau Oil Refinery LLP with control devices."',
proj19:'Client CaspiOilGas LLP',
proj20:'Arrangement of the Rakushechnoye oil field during exploration and trial operation. Oil preparation station at the Rakushechnoye oil field.',
proj21:'Client "Alties Petroleum International B.V."',
proj22:'Arrangement of the Besbolek oil field for the period of exploration and production;',
proj23:'Construction of an oil pipeline from the Akzhar field to the tie-in point into the main oil pipeline of KazTransOil JSC',
proj24:'"Karsak" munay kabyldau zhune tasymaldau point;',
proj25:'Technological regulations for the operation of the Karsak acceptance point;',
proj26:'Oldanystaky Zharқamys Kosalқy stan .synan zhobalanyp zhatқan "Aқzhar" Kosalқy stan .syna deyin 35 kilovolt kerneuі bar electr berudin әue zhelisin zhobalau',
proj27:'Client Alties Petroleum International B.V.',
proj28:'Development and implementation of a program for the utilization of associated gas at the Karaturun Morskoy and Karaturun Vostochny gas and oil fields.',
proj29:'Client Kazkhimmontazh holding JSC (Agip KCO)',
proj30:'Construction of the East Kashagan oil and gas field. Vertical steel tanks with a volume of 1500 m³; 1800 m³; 2200 m³ and 5800 m³. for water storage at the site of engineering support of the construction camp.',
proj31:'Client Kazakh Institute for Oil and Gas Transport LLP',
proj32:'At the request and instructions of the shareholders of KITNG LLP, in the period from December. 2007 to June 2011, a group of executives and chief specialists of MG Engineering implemented significant stages of work on project management "Designing an effective organization" to carry out a set of design works:',
proj33:'"Construction of the main gas pipeline Kazakhstan - China";',
proj34:'"Construction of the main oil pipeline Kenkiyak - Kumkol"',
proj35:'Client Big Sky Energy Corp.',
proj36:'Construction of the Morskoye oil field.',
proj37:'Client Lancaster Petroleum (KKM Operating Company JSC)',
proj38:'Gathering and transportation of products from Kokzhide-Nadsolevoye oilfield wells;',
proj39:'Expansion of oil processing shop at the Kokzhide-Nadsolevoye oilfield;',
proj40:'New rotation village for service personnel accommodation;',
proj41:'Development of regulatory technical documentation on "Process losses of oil and gas during gathering, transportation and treatment at the KKM Operating Company JSC industrial facilities".',
proj42:'Client CNPC-Aktobemunaigas JSC',
proj43:'Objects and constructions of the system of automatic hermetic loading and unloading of oil at the railway station "Bestamak".',
proj44:'Client Imstalkon JSC',
proj45:'Construction of vertical steel process tanks for the central oil treatment center at the Karazhanbas oil and gas field;',
proj46:'Reconstruction of the tank farm at the Tengiz intermediate pumping station;',
proj47:'Purified sour water tank farm and general maintenance at the Tengiz oil field.',
proj48:'Client Karazhanbasmunai JSC',
proj49:'Installation of group metering installations;',
proj50:'Construction of new technological facilities at the Karazhanbas gas and oil field;',
proj51:'Expansion of the reservoir park of the booster pumping station at the Karazhanbas gas and oil field;',
proj52:'Expansion of the central oil treatment center.',
proj53:'Client CaspiNeft TME JSC',
proj54:'Gathering and transportation of products from "Alibek South" oil and gas condensate field wells;',
proj55:'Еxpansion of oil loading station at "Alibek South" field;',
proj56:'Water injection unit at the Alibek South field;',
proj57:'Intra-field roads at the Alibek South field;',
proj58:'Reconstruction of substation PS-110/35/10 kV "Kenkiyak" and other structures and power supply devices.',
proj59:'Client Condensate JSC',
proj60:'repair and replacement of GP-3-Orenburg nonpurified gas pipeline section;',
proj61:'development of conceptual project of the company petrol-filling station, Uralsk.',
proj62:'Client MontazhSpetsStroy JSC',
proj63:'Development of tender documentation on the "Expansion of the seawater intake facility";',
proj64:'Modular building of Tengizchevroil LLP temporary Office;',
proj65:'Gas turbine power station at "Dunga" oil and gas field.',
proj66:'Client BN Munai LLP',
proj67:'Development of the Kziloy gas field in the Aktobe region;',
proj68:'In-field gas gathering pipelines.',
proj69:'Client Dostyk Refinery LLP',
proj70:'"Dostyk-2" railway light oils export-transshipment bulk plant;',
proj71:'Reconstruction of "Dostyk" railway export-transshipment bulk plant.',
proj72:'Client Prosystems Petroleum LLP',
proj73:'Reconstruction of service petrol-filling station, Almaty.',
proj74:'Client Sinooil LLP',
proj75:'Reconstruction of petroleum supply point, Astana;',
proj76:'Service petrol-filling station, Almaty region, Karasai district, Kaskelen-Shamalgan lay of line;',
proj77:'Service petrol-filling station, Almaty region, Enbekshikazakh district;',
proj78:'Service petrol-filling station, Almaty region, Zhambyl district, Uzunagash village.',
proj79:'Client Artis Overseas S.A.Kazakhstan LLP',
proj80:'Оil terminal expansion. Aktau sea port.',
proj81:'Client Zhaikmunai LLP',
proj82:'Facilities and structures of Chinarevskoye oil and gas condensate field development.',
proj83:'Client Kazakhoil Aktobe LLP',
proj84:'Development of "Kozhasai" oil and gas condensate field during production test period;',
proj85:'Oil receiving and treatment station at "Alibekmola" oil and gas condensate field;',
proj86:'Industrial effluents utilization system by their injection to the formation at "Alibekmola" field;',
proj87:'Reservoir pressure maintenance system in the north of "Alibekmola" oil and gas condensate field;',
proj88:'Development of process procedure for operation of oil treatment station at "Alibekmola" field;',
proj89:'Power supply system at "Kozhasai" field;',
proj90:'Air transmission power lines of 6kV capacity with "Alibekmola South" substation for power supply of "Alibekmola" field central processing center.',
proj91:'Client Ken-Sary LLP',
proj92:'Development of "Arystanovskoye" oil field during exploration and production test. Startup complex I, II;',
proj93:'Development of "Arystanovskoye" field. Startup complex III;',
proj94:'Oil treatment station of "Arystanovskoye" field.',
proj95:'Client Kazakh-China Pipeline LLP',
proj96:'Сonstruction of Kazakhstan-China oil pipeline. Kenkiyak-Kumkol section. "Consolidated emergency response station".',
proj97:'Client MegaTransAsia LLP',
proj98:'Еxpansion of bulk plant facilities. Petroleum products processing shop at Beskol station, Alakolskiy district, Almaty region;',
proj99:'Оil refinery of 1 100 000 t/year capacity;',
proj100:'Oil refinery with a capacity of 600,000 tons / year.',
proj101:'Client NT Nurly Munai LLP',
proj102:'"NT Nurly Munai" crude oil delivery and acceptance point.',
proj103:'Client Sagiz Petroleum Company LLP',
proj104:'Еvaluation of scope and cost of "Ebity" crude oil delivery and acceptance point construction and assembly. Interlocking pipeline including tie-in to "Kenkiyak-Atyrau" oil trunkline at Baiganinskiy district, Aktyubinsk region.',
proj105:'Client South Oil LLP',
proj106:'Сonstruction of oil custody metering skid and oil pipeline at "Kenlyk" oil field including tie-in to the "Kenkiyak-Kumkol" oil trunkline.',
proj107:'Client TEK Kazakhstan LLP',
proj108:'Reconstruction of fuel warehouses of locomotive servicing at Dostyk, Ushtobe and Kostanai railway stations.',
proj109:'Client Umai-Market LLP',
proj110:'Dispatching railway terminal of light oils, Arys city;',
proj111:'Technical assistance and construction management.',
proj112:'Client Ernst and Young consulting services LLP',
proj113:'Development of feasibility study for construction and operation of 95 vehicle gas-filling compressor stations in the Republic of Kazakhstan.',
proj114:'and many more projects, works and services',









    act01:'The company activity is aimed at superior implementation of engineering and design package, construction of new facilities, reconstruction and upgrade of oil and gas industrial facilities and structures already in operation.',

    act02:'The company is open for cooperation and is ready to accept any mutually beneficial offers in efficient performance of oil and gas production, treatment and transportation projects both inside and outside Kazakhstan.',
    
    act1:'INTEGRATED DESIGN OF:',

    act2:'development of oil and gas condensate fields:',
    act3:'- well development;',
    act4:'- systems of field gathering of well products;',
    act5:'- metering stations;',
    act6:'- formation water primary discharge units;',
    act7:'- reservoir pressure maintenance systems;',
    act8:'- cluster pumping and compressor stations;',
    act9:'facilities of oil and gas treatment to market standard:',
    act10:'- oil and gas treatment units;',
    act11:'- products receiving and recording units;',
    act12:'- oil separation units including degassing, dehydration, demineralization and demercaptanization;',
    act13:'- gas sweetening and dehydration units;',
    act14:'- preliminary gas processing terminals (PGPT);',
    act15:'- gas processing plants (GPP);',
    act16:'- units for preparation of mud and components associated with oil and gas treatment;',
    act17:'- reservoir water treatment units;',
    act18:'- process pumping and compressor stations;',
    act19:'- tank farms for gathering ready products;',
    act20:'- pumping and compressor stations to pump ready products;',
    act21:'',
    act22:'',
    act23:'oil and gas transportation facilities and structures:',
    act24:'- any purpose trunklines;',
    act25:'- oil and gas field, process and distribution pipelines;',
    act26:'facilities for oil, gas and hydrocarbon materials processing;',
    act27:'petroleum products storage, distribution and sales;',
    act28:'gas storage, distribution and sales;',
    act29:'other facilities incorporated into the infrastructure of oil production, pipeline transport, industrial and civil structures;',
    act30:'fire and electro-chemical protection systems;',
    act31:'communications, power-, heat- and gas supply means, air conditioning systems and other utilities;',
    act32:'systems of automated control and management of process flows and facilities;',
    act33:'actions to prevent the environmental contamination with oil and petroleum products, power saving and labor protection.',
    act34:'FEASIBILITY STUDIES:',
    act35:'technical and economic estimates;',
    act36:'feasibility study of investments.',
    act37:'TECHNICAL INSPECTIONS OF:',
    act38:'existing oil and gas package facilities including assessment of their environmental impact;',
    act39:'development of recommendations for repair, reconstruction and upgrade of oil and gas package facilities inspected.',
    act40:'',
    act41:'',
    act42:'TECHNICAL AND DESIGNER SUPERVISION OF THE CONSTRUCTION',
    act43:'',
    act44:'DEVELOPMENT OF REGULATORY, REVIEW-ANALYTICAL DOCUMENTATION',
    act45:'',
    act46:'ENGINEERING SERVICES:',
    act47:'preparing documentation and holding tenders;',
    act48:'obtaining and arranging input data;',
    act49:'preparation of technical specifications;',
    act50:'preparation of documentation and doing approvals;',
    act51:'procurement for oil and gas industry;',
    act52:'management of construction, implementation of separate oil and gas package facilities, industrial and civil construction on a turn-key basis.',
    act53:'',






//     cert2:'Сертификат ҚР СТ ИСОС 18001:2007 «Еңбектіқорғаужәнеденсаулықтыбасқаружүйесі», «Қазақстандықсертификаттауорталығы» ЖШС берген.',

// Сертификат ҚР СТ ИСО 14001:2015 «Экологиялықменеджментжүйесі» ЖШС «Қазақстандықсертификаттауорталығы» ЖШС берген.',

// cert4:'Сертификат СМЖ ISO 9001:2008 «Мұнай мен газ саласының құрылысына арналған инженерлік қызметтердің кешені және ілеспе инфрақұрылым», SGS Systems & Services Certification компаниясынан берілген.',


// cert5:'ЛИЦЕНЗИЯЛАР',

// cert6:'Мемлекеттік лицензия 14016989 (бірінші) санат (басты) 10.11.2014 ж. ',
// cert61:'бастап жобалау қызметтерін орындауға, Құрылыс және тұрғын үй-коммуналдық шаруашылық істері және жер ресурстарын басқару комитетінен берілген. Қазақстан Республикасы ұлттық экономика министрлігі.',

// cert7:'Мемлекеттік лицензия 14001279 (басты) 04.02.2014 ж. ',
// cert71:'бастап тау – кен (пайдалы қазбаларды барлау, өңдіру), мұнай-химия, химия өндірістерін жобалау(технологиялық) және (немесе) пайдалану, мұнай-газ өндеу жобалау (технологиялық), магистральдық газ құбырларын пайдалану, Қазақстан Республикасының мұнай және газ минимтрлігінен берілген. Қазақстан Республикасы мұнай және газ министрлігі мұнай-газ кешеніндегі мемлекеттік инспекциялау комитеті.',

// cert8:'Лицензия 01625Р (басты) 23.01.2014 ж. ',
// cert81:'бастап қоршаған ортаны қорғау саласында жұмыстарын орындау және қызметтер көрсету, Қазақстан Республикасының Қоршаған орта және су ресурстары министрлігінен берілген. Қазақстан Республикасы Қоршаған орта және су ресурстары министрлігінің Экологиялық реттеу және бақылау комитеті.',

    cert1:'CERTIFICATES',

    cert2:'QMS Certificate ST RK OHSAS 18001: 2007 "Occupational Safety and Health Management System" issued by "Kazakhstan Center for Certification" LLP.',
    
    cert3:'QMS Certificate ST RK ISO 14001: 2015 "Environmental Management System" issued by "Kazakhstan Center for Certification" LLP.',
    
    cert4:'QMS Certificate ISO 9001:2008 "Package of engineering services for construction of oil and gas industrial facilities and associated infrastructure" issued by SGS Systems & Services Certification Company',
    
    
    cert5:'LICENSES',
    
    cert6:'State license 14016989 of category I (general) dated 10.11.2014 ',
    cert61:'for designing issued by the Construction and housing and utilities infrastructure and management of land resources Affairs Committee. The Ministry of national economics of the Republic of Kazakhstan.',
    
    cert7:'State license 14001279 (general) dated 04.02.2014 ',
    cert71:'for designing (process) and (or) operation of mining (exploration, production of natural resources), oil chemistry, chemical production facilities, designing (process) oil and gas processing facilities, operation of gas trunklines, and petroleum products pipelines issued by the Ministry of oil and gas of the Republic of Kazakhstan. Committee of the state inspection in oil and gas complex of the Ministry of oil and gas of the Republic of Kazakhstan.',
    
    cert8:'License 01625Р (general) dated 23.01.2014 ',
    cert81:'for performance of works and provision of the environmental services issued by the Ministry of the Environmental Protection and Water Resources of the Republic of Kazakhstan. Committee for the environmental regulation and control of the Ministry of the Environmental Protection and Water Resources of the Republic of Kazakhstan.',


    cont0:'Map:',

   cont1:'The Republic of Kazakhstan',
   cont2:'Almaty, 050052,',
   cont3:'Taugul-3 microdistrict,',
   cont4:' Zhanturina st., 23',
   cont5:'Tel.: +7 (727) 239 12 33',
   cont6:' Tel.: +7 (727) 239 77 21',
   cont7:' Tel.: +7 (727) 239 77 24',
   cont8:' E-mail: secretary@mg-eng.kz',
      }],
      currentIndex: 0
    }
  }

  myFunction() {
  var x = document.getElementById("main-nav");
  if (x.style.display === "grid") {
    x.style.display = "none";
  } else {
    x.style.display = "grid";
  }
  }
 
  toggleShow = () => {
    this.setState(state => ({ isShow: !state.isShow }));
  };
 

  render() {
    const style = {
      position: 'absolute',
      left: 0,
      top: 0,
      width: '90%',
      height: '70%'
    };
    return (
      <div class="">
           {/* <Navbar bg="light" expand="lg" sticky="top" style={{'font-size': '0.9rem',  'box-shadow': '0 10px 33px rgba(0, 0, 0, .1)'}}  className='container'>
            <Navbar.Brand href="#block1"><img src={logo}/></Navbar.Brand>
            <Navbar.Toggle aria-controls="basic-navbar-nav" />
            <Navbar.Collapse id="basic-navbar-nav">
              <Nav className="mr-auto">
              		
                <Nav.Link href="#block1" className=''>{ this.state.list[this.state.currentIndex].menu1}</Nav.Link>
                <Nav.Link href="#block2" >{ this.state.list[this.state.currentIndex].menu2}</Nav.Link>
                <Nav.Link href="#block3">{ this.state.list[this.state.currentIndex].menu3}</Nav.Link>
                <Nav.Link href="#block4">{ this.state.list[this.state.currentIndex].menu4}</Nav.Link>
                <Nav.Link href="#block5">{ this.state.list[this.state.currentIndex].menu5}</Nav.Link>
                <Nav.Link href="#block6">{ this.state.list[this.state.currentIndex].menu6}</Nav.Link>
                <Nav.Link href="#block7">{ this.state.list[this.state.currentIndex].menu7}</Nav.Link>
                <Nav.Link href="#link"></Nav.Link>
                <NavDropdown title={ this.state.list[this.state.currentIndex].menu8} id="basic-nav-dropdown">
                  <NavDropdown.Item href="" onClick={
                        () => {
                          this.setState({ currentIndex: 0 })
                        }
                      } > RU</NavDropdown.Item>
                  <NavDropdown.Item href="" onClick={
                        () => {
                          this.setState({ currentIndex: 1})
                        }
                      }> KZ</NavDropdown.Item>
                
                  <NavDropdown.Item href="" onClick={
                        () => {
                          this.setState({ currentIndex: 2 })
                        }
                      }> EN</NavDropdown.Item>
                
                 
                </NavDropdown>
              </Nav>
             
               
                     
            </Navbar.Collapse>
          </Navbar> */}
          <Navbar collapseOnSelect expand="lg"  sticky="top"  bg="light" style={{'font-size': '0.9rem','box-shadow':'0 10px 33px rgba(0, 0, 0, .1)'}}  className='container'>
              
              <Navbar.Brand href="#block1"><img src={logo}/></Navbar.Brand>
              <Navbar.Toggle aria-controls="responsive-navbar-nav" />
              
             
              <Navbar.Collapse id="responsive-navbar-nav">
                <Nav className="mr-auto">
                <Nav.Link href="#block1" className=''>{ this.state.list[this.state.currentIndex].menu1}</Nav.Link>
                <Nav.Link href="#block2" >{ this.state.list[this.state.currentIndex].menu2}</Nav.Link>
                <Nav.Link href="#block3">{ this.state.list[this.state.currentIndex].menu3}</Nav.Link>
                <Nav.Link href="#block4">{ this.state.list[this.state.currentIndex].menu4}</Nav.Link>
                <Nav.Link href="#block5">{ this.state.list[this.state.currentIndex].menu5}</Nav.Link>
                <Nav.Link href="#block6">{ this.state.list[this.state.currentIndex].menu6}</Nav.Link>
                <Nav.Link href="#block7">{ this.state.list[this.state.currentIndex].menu7}</Nav.Link>
                  <NavDropdown  title={ this.state.list[this.state.currentIndex].menu8} id="collasible-nav-dropdown">
                  <NavDropdown.Item href="" onClick={
                        () => {
                          this.setState({ currentIndex: 0 })
                        }
                      } > RU</NavDropdown.Item>
                  <NavDropdown.Item href="" onClick={
                        () => {
                          this.setState({ currentIndex: 1})
                        }
                      }> KZ</NavDropdown.Item>
                
                  <NavDropdown.Item href="" onClick={
                        () => {
                          this.setState({ currentIndex: 2 })
                        }
                      }> EN</NavDropdown.Item>
                
                 
                </NavDropdown>
                  
                </Nav>
              
              </Navbar.Collapse>
            </Navbar>
     {/* КОНЕЦ МЕНЮХИ---------------------------------------------------------------------- */}
		<div >
      
      <div id='block1' >
        <br/>
        <br/>
        <br/>
        <br/>
        <br/>
        <br/>
       
       <div className="bg-overlay ">
          <div  className='container ​hhide'  >
            <SimpleSlider/>
         </div>
        
       </div>
        
        <div className="container">
        <br/>
                        <div className="row align-items-center">
                            <div className="col-lg-12 order-2 order-lg-1">
                                <div className="features-box mt-5 mt-lg-0">
                                <Card style={{ width: '23rem' }}>
  
                                    <Card.Body>
                                      <Card.Title> <h4>
                                        <b>{ this.state.list[this.state.currentIndex].text01} </b><br/>
                                        <b> { this.state.list[this.state.currentIndex].text02}</b> <br/>
                                        <b>{ this.state.list[this.state.currentIndex].text03}</b>
                                        </h4>
                                      </Card.Title>
                                      
                                    
                                    </Card.Body>
                                  </Card>
                                     
                                    <ul className="text-muted list-unstyled margin-t-30 features-item-list" className="text-muted list-unstyled margin-t-30 features-item-list">
                                    <li>{ this.state.list[this.state.currentIndex].text1}</li>
                                    <li>{ this.state.list[this.state.currentIndex].text2}</li>
                                    <li>{ this.state.list[this.state.currentIndex].text3}</li>
                                      <li>{ this.state.list[this.state.currentIndex].text4}</li>
                                      <li>{ this.state.list[this.state.currentIndex].text5}</li>
                                      
                                      
                                    </ul>
                                    
                                     
                                      { this.state.list[this.state.currentIndex].text8}
                                    <h4><b>{this.state.list[this.state.currentIndex].text6}<br/> { this.state.list[this.state.currentIndex].text7}</b></h4>
                                    {/* <Link to="#" className="btn btn-custom margin-t-30 waves-effect waves-light">Learn More <i className="mdi mdi-arrow-right"></i></Link> */}
                                </div>
                            </div>
                            {/* <div className="col-lg-7 order-1 order-lg-2">
                                <div className="features-img mx-auto mr-lg-0">
                                    <img src={grAnaly} alt="macbook" className="img-fluid" />
                                </div>
                            </div> */}
                        </div>
                    </div>
                    {/* <Route path="/" component={App} />  */}
      
      
      </div>
      


      <div id='block2' >
        
      <br/> <br/> <br/> <br/> <br/> <br/>
       
        <div className="container">
                        <div className="row align-items-center">
                            <div className="col-lg-12 order-2 order-lg-1">
                                <div className="features-box mt-5 mt-lg-0">
        {/* <Greeting greeting={greeting} isShow={this.state.isShow} /> */}
          {/* <h2>{ this.state.list[this.state.currentIndex].text01}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text02}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text03}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text4}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text5}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text6}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text7}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text8}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text9}</h2>
          <h2>{ this.state.list[this.state.currentIndex].text10}</h2> */}


              <p>{ this.state.list[this.state.currentIndex].about1}</p>
              <p>{ this.state.list[this.state.currentIndex].about111}</p>
              
              <p><b>{ this.state.list[this.state.currentIndex].about2}</b></p>
             
              <p>{ this.state.list[this.state.currentIndex].about3}</p>
                
                <ul className="text-muted list-unstyled margin-t-30 features-item-list">
                
              
                <li>           { this.state.list[this.state.currentIndex].about4}     </li>
                <li>           { this.state.list[this.state.currentIndex].about5}     </li>
                <li>           { this.state.list[this.state.currentIndex].about6}     </li>
                <li>           { this.state.list[this.state.currentIndex].about7}     </li>
                <li>           { this.state.list[this.state.currentIndex].about8}     </li>
                <li>           { this.state.list[this.state.currentIndex].about9}     </li>
               


                </ul> 

                <p>{ this.state.list[this.state.currentIndex].about10}</p>
                <p>{ this.state.list[this.state.currentIndex].about11}</p>
                <p><b>{ this.state.list[this.state.currentIndex].about12}</b></p>
                <ul className="text-muted list-unstyled margin-t-30 features-item-list">
                
              
                <li>           { this.state.list[this.state.currentIndex].about13}     </li>
                <li>           { this.state.list[this.state.currentIndex].about14}     </li>
                <li>           { this.state.list[this.state.currentIndex].about15}     </li>
                <li>           { this.state.list[this.state.currentIndex].about16}     </li>
                <li>           { this.state.list[this.state.currentIndex].about17}     </li>
                <li>           { this.state.list[this.state.currentIndex].about18}     </li>
                <li>           { this.state.list[this.state.currentIndex].about19}     </li>
                <li>           { this.state.list[this.state.currentIndex].about20}     </li>
                <li>           { this.state.list[this.state.currentIndex].about21}     </li>
               


                </ul> 

         
            </div>
            </div>
            </div>
            </div>
     
      </div>
      
      <div id='block3'>
      <br/> <br/> <br/> <br/> <br/> <br/>
       
      <div className="container">
             
                
                <div className="row margin-t-50">
                
                    <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img1} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name">{ this.state.list[this.state.currentIndex].upr2}</h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr3}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr4}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr5}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr6}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr7}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr8}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr9}</p>
                       
                           
                        </div>
                    </div>

                    <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img2} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr10} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr11}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr12}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr13}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr14}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr15}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr16}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr17}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr18}</p>
                        </div>
                    </div>

                    <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img3} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr19} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr20}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr21}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr22}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr23}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr24}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr25}</p>
                       
                            </div>
                    </div>
                    
                    <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img4} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr27} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr28}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr29}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr30}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr31}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr32}</p>
                         
                        </div>
                    </div>

                    <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img5} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr33} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr34}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr35}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr36}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr37}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr38}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr39}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr40}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr41}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr42}</p>
                           
                          </div>
                    </div>

                    <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img6} className="img-fluid rounded" />
                                </div>
                            </div>
                            
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr43} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr44}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr45}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr46}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr47}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr48}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr49}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr50}</p>
                                
                                    </div>
                    </div>

                    {/* <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img7} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr51} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr52}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr53}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr54}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr55}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr56}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr57}</p>
                          
                                
                        </div>
                    </div> */}

                    {/* <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img8} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr58} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr59}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr60}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr61}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr62}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr63}</p>
                     
                    </div>
                </div> */}
                    <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img9} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr64} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr65}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr66}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr67}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr68}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr69}</p></div>
                    </div>

                    <div className="col-lg-3 col-sm-6">
                        <div className="team-box text-left">
                            <div className="team-wrapper">
                                <div className="team-member">
                                    <img alt="" src={img10} className="img-fluid rounded" />
                                </div>
                            </div>
                            <h4 className="team-name"> { this.state.list[this.state.currentIndex].upr70} </h4>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr71}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr72}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr73}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr74}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr75}</p>
                            <p className=" team-designation"> { this.state.list[this.state.currentIndex].upr76}</p>
                             </div>
                    </div>

                </div>
            </div>
        
      </div>
      
      <div id='block4'> 
      <br/> <br/> <br/> <br/> <br/> <br/>
        <div className="container">
        <p align="center"><font color="#1E6FB5" size="4">
           <b>{ this.state.list[this.state.currentIndex].proj1}</b> </font>
        </p>
                
          <p><b>{ this.state.list[this.state.currentIndex].proj2}</b></p>
          <p><b>{ this.state.list[this.state.currentIndex].proj3}</b></p>
          <p><b>{ this.state.list[this.state.currentIndex].proj4}</b></p>
          <p><b>{ this.state.list[this.state.currentIndex].proj5}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj6}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj7}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj8}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj9}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj10}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj11}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj12}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj13}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj14}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj15}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj16}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj17}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj18}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj19}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj20}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj21}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj22}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj23}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj24}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj25}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj26}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj27}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj28}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj29}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj30}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj31}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj32}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj33}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj34}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj35}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj36}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj37}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj38}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj39}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj40}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj41}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj42}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj43}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj44}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj45}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj46}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj47}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj48}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj49}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj50}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj51}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj52}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj53}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj54}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj55}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj56}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj57}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj58}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj59}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj60}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj61}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj62}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj63}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj64}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj65}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj66}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj67}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj68}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj69}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj70}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj71}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj72}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj73}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj74}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj75}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj76}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj77}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj78}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj79}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj80}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj81}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj82}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj83}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj84}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj85}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj86}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj87}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj88}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj89}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj90}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj91}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj92}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj93}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj94}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj95}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj96}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj97}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj98}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj99}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj100}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj101}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj102}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj103}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj104}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj105}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj106}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj107}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj108}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj109}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj110}</li></ul>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj111}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj112}</b></p>
          <ul className='text-muted list-unstyled margin-t-30 features-item-list'><li>{ this.state.list[this.state.currentIndex].proj113}</li></ul>
          <p><b>{ this.state.list[this.state.currentIndex].proj114}</b></p>


                    
        </div>
      </div>
      
      <div id='block5'>
      <br/> <br/> <br/> <br/> <br/> <br/>
        <div className="container">
          <div className="row align-items-center">
            <div className="col-lg-12 order-2 order-lg-1">
               <div className="features-box mt-5 mt-lg-0">
                  <p><b>{this.state.list[this.state.currentIndex].act01}</b></p>
                  <br/>
                  <p><b>{this.state.list[this.state.currentIndex].act02}</b></p>
                  <ul id='clearUl'>
                  <font color="#1E6FB5" size="4">{this.state.list[this.state.currentIndex].act1}</font>
                   <li>
                     <ul id='clearUl' >
                     <b>{this.state.list[this.state.currentIndex].act2}</b>
                     <li>{this.state.list[this.state.currentIndex].act3}</li>
                     <li>{this.state.list[this.state.currentIndex].act4}</li>
                     <li>{this.state.list[this.state.currentIndex].act5}</li>
                     <li>{this.state.list[this.state.currentIndex].act6}</li>
                     <li>{this.state.list[this.state.currentIndex].act7}</li>
                     <li>{this.state.list[this.state.currentIndex].act8}</li>
                     </ul>
                     <ul id='clearUl'>
                     <b>{this.state.list[this.state.currentIndex].act9}</b>
                     <li>{this.state.list[this.state.currentIndex].act10}</li>
                     <li>{this.state.list[this.state.currentIndex].act11}</li>
                     <li>{this.state.list[this.state.currentIndex].act12}</li>
                     <li>{this.state.list[this.state.currentIndex].act13}</li>
                     <li>{this.state.list[this.state.currentIndex].act14}</li>
                     <li>{this.state.list[this.state.currentIndex].act15}</li>
                     <li>{this.state.list[this.state.currentIndex].act16}</li>
                     <li>{this.state.list[this.state.currentIndex].act17}</li>
                     <li>{this.state.list[this.state.currentIndex].act18}</li>
                     <li>{this.state.list[this.state.currentIndex].act19}</li>
                     <li>{this.state.list[this.state.currentIndex].act20}</li>
                     <li>{this.state.list[this.state.currentIndex].act21}</li>
                     </ul>
                     <ul id='clearUl'>
                     {this.state.list[this.state.currentIndex].act22}
                     <li><b>{this.state.list[this.state.currentIndex].act23}</b></li>
                     <li>{this.state.list[this.state.currentIndex].act24}</li>
                     </ul>
                     <ul id='clearUl'><li>{this.state.list[this.state.currentIndex].act25}</li></ul>
                     <ul id='clearUl'><li><b>{this.state.list[this.state.currentIndex].act26}</b></li></ul>
                     <ul id='clearUl'><li><b>{this.state.list[this.state.currentIndex].act27}</b></li></ul>
                     <ul id='clearUl'><li><b>{this.state.list[this.state.currentIndex].act28}</b></li></ul>
                     <ul id='clearUl'><li><b>{this.state.list[this.state.currentIndex].act29}</b></li></ul>
                     <ul id='clearUl'><li><b>{this.state.list[this.state.currentIndex].act30}</b></li></ul>
                     <ul id='clearUl'><li><b>{this.state.list[this.state.currentIndex].act31}</b></li></ul>
                     <ul id='clearUl'><li><b>{this.state.list[this.state.currentIndex].act32}</b></li></ul>
                     <ul id='clearUl'><li><b>{this.state.list[this.state.currentIndex].act33}</b></li></ul>


                   </li>
                   
                  </ul>
                  <ul id='clearUl'>
                  <font color="#1E6FB5" size="4">{this.state.list[this.state.currentIndex].act34}</font>
                   <li><b>{this.state.list[this.state.currentIndex].act35}</b></li>
                   <li><b>{this.state.list[this.state.currentIndex].act36}</b></li>
                   </ul>
                   <ul id='clearUl'>
                  <font color="#1E6FB5" size="4">{this.state.list[this.state.currentIndex].act37}</font>
                   <li><b>{this.state.list[this.state.currentIndex].act38}</b></li>
                   <li><b>{this.state.list[this.state.currentIndex].act39}</b></li>
                   </ul>
                   <ul id='clearUl'>
                    <font color="#1E6FB5" size="4">{this.state.list[this.state.currentIndex].act40}</font>
                   </ul>
                   <ul id='clearUl'>
                    <font color="#1E6FB5" size="4">{this.state.list[this.state.currentIndex].act41}</font>
                   </ul>
                   <ul id='clearUl'>
                    <font color="#1E6FB5" size="4">{this.state.list[this.state.currentIndex].act42}</font>
                    
                   </ul>
                  
                   <ul id='clearUl'>
                    <font color="#1E6FB5" size="4">{this.state.list[this.state.currentIndex].act46}</font>

                    {/* <li>{this.state.list[this.state.currentIndex].act44}</li>
                    <li><b>{this.state.list[this.state.currentIndex].act45}</b></li> */}
                    
                    <li><b>{this.state.list[this.state.currentIndex].act47}</b></li>
                    <li><b>{this.state.list[this.state.currentIndex].act48}</b></li>
                    <li><b>{this.state.list[this.state.currentIndex].act49}</b></li>
                    <li><b>{this.state.list[this.state.currentIndex].act50}</b></li>
                    <li><b>{this.state.list[this.state.currentIndex].act51}</b></li>
                    <li><b>{this.state.list[this.state.currentIndex].act52}</b></li>
                    </ul>

               </div>
            </div>
          </div>
          </div>
      </div>
      
      <div id='block6' >
      <br/> <br/> <br/> <br/> <br/> <br/>
        <div className="container">
        <Row>
          <Col>
          <p><font color="#1E6FB5" size="4">{ this.state.list[this.state.currentIndex].cert1}</font></p>
          <p>{ this.state.list[this.state.currentIndex].cert2}</p>
          <p>{ this.state.list[this.state.currentIndex].cert3}</p>
          <p>{ this.state.list[this.state.currentIndex].cert4}</p>
          <p><font color="#1E6FB5" size="4">{ this.state.list[this.state.currentIndex].cert5}</font></p>
          <p><b>{ this.state.list[this.state.currentIndex].cert6}</b>{ this.state.list[this.state.currentIndex].cert61}</p>
          <p><b>{ this.state.list[this.state.currentIndex].cert7}</b>{ this.state.list[this.state.currentIndex].cert71}</p>
          <p><b>{ this.state.list[this.state.currentIndex].cert8}</b>{ this.state.list[this.state.currentIndex].cert81}</p>
          
          
          </Col>
          <Col><img src={cert}></img></Col>
        </Row>
          </div>
      </div>
      
      <div id='block7'>
      <br/> <br/> <br/> <br/> <br/> <br/>
      
        <div className="container">
        <h5><b>{ this.state.list[this.state.currentIndex].cont0}</b></h5>
        <Row>
           <Col>
          <YMaps>
            <Map defaultState={mapData} style={style} >
              {coordinates.map(coordinate => <Placemark geometry={coordinate} />)}
            </Map>
          </YMaps>
          <div>
          </div>
          </Col>
          <Col>
            <p><b>{ this.state.list[this.state.currentIndex].cont1}</b></p>
            <p>{ this.state.list[this.state.currentIndex].cont2}</p>
            <p>{ this.state.list[this.state.currentIndex].cont3}</p>
            <p>{ this.state.list[this.state.currentIndex].cont4}</p>
            <p>{ this.state.list[this.state.currentIndex].cont5}</p>
            <p>{ this.state.list[this.state.currentIndex].cont6}</p>
            <p>{ this.state.list[this.state.currentIndex].cont7}</p>
            <p>{ this.state.list[this.state.currentIndex].cont8}</p>
          </Col>
        </Row>
          </div>
          <br/> <br/> <br/> <br/> <br/> <br/>
      </div>
      <Navbar>
        <Navbar.Brand href="#">
          <div className='container'>
          
          </div>
          </Navbar.Brand>
        <Navbar.Toggle />
        <Navbar.Collapse className="justify-content-end">
          <Navbar.Text>
            Almaty 2020 | <a href="#login">mg-eng.kz</a>
          </Navbar.Text>
        </Navbar.Collapse>
      </Navbar>
      
      </div>
      <Switch>
              <Route
                exact
                path="/"
                render={() => {
                    return (
                     
                      <Redirect to="#block1" /> 
                     
                    )
                }}
              />
              </Switch>
      </div>
      
    );
  }
}
 
const Greeting = ({ greeting, isShow }) =>
  isShow ? <h1>{greeting}</h1> : null;
 
export default App;